<!DOCTYPE html>
<html>
<head>
    <!-- hexo-inject:begin --><!-- hexo-inject:end --><meta charset="utf-8">
    
    <title>Monolith to Serverless using AWS Lambda (1) | Dev Star SJ</title>
    <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
    
        <meta name="keywords" content="AWS,Lambda,Serverless" />
    
    <meta name="description" content="Monolith to Serverless using AWS Lambda &amp;#xAE30;&amp;#xC874; &amp;#xBAA8;&amp;#xB178;&amp;#xB9AC;&amp;#xC2A4; API &amp;#xC11C;&amp;#xBC84;&amp;#xB97C; AWS Lambda&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xC11C;&amp;#xBC84;&amp;#xB9AC;&amp;#xC2">
<meta name="keywords" content="AWS,Lambda,Serverless">
<meta property="og:type" content="article">
<meta property="og:title" content="Monolith to Serverless using AWS Lambda (1)">
<meta property="og:url" content="http://DevStarSJ.github.io/2017/02/23/MonolithToServerless.01/index.html">
<meta property="og:site_name" content="Dev Star SJ">
<meta property="og:description" content="Monolith to Serverless using AWS Lambda &amp;#xAE30;&amp;#xC874; &amp;#xBAA8;&amp;#xB178;&amp;#xB9AC;&amp;#xC2A4; API &amp;#xC11C;&amp;#xBC84;&amp;#xB97C; AWS Lambda&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xC11C;&amp;#xBC84;&amp;#xB9AC;&amp;#xC2">
<meta property="og:updated_time" content="2017-04-23T09:28:24.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="Monolith to Serverless using AWS Lambda (1)">
<meta name="twitter:description" content="Monolith to Serverless using AWS Lambda &amp;#xAE30;&amp;#xC874; &amp;#xBAA8;&amp;#xB178;&amp;#xB9AC;&amp;#xC2A4; API &amp;#xC11C;&amp;#xBC84;&amp;#xB97C; AWS Lambda&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xC11C;&amp;#xBC84;&amp;#xB9AC;&amp;#xC2">
    

    

    

    <link rel="stylesheet" href="/libs/font-awesome/css/font-awesome.min.css">
    <link rel="stylesheet" href="/libs/titillium-web/styles.css">
    <link rel="stylesheet" href="/libs/source-code-pro/styles.css">

    <link rel="stylesheet" href="/css/style.css">

    <script src="/libs/jquery/2.0.3/jquery.min.js"></script>
    
    
        <link rel="stylesheet" href="/libs/lightgallery/css/lightgallery.min.css">
    
    
        <link rel="stylesheet" href="/libs/justified-gallery/justifiedGallery.min.css"><!-- hexo-inject:begin --><!-- hexo-inject:end -->
    
    
    

</head>

<body>
    <!-- hexo-inject:begin --><!-- hexo-inject:end --><div id="wrap">
        <header id="header">
    <div id="header-outer" class="outer">
        <div class="container">
            <div class="container-inner">
                <div id="header-title">
                    <h1 class="logo-wrap">
                        <a href="/" class="logo"></a>
                    </h1>
                    
                        <h2 class="subtitle-wrap">
                            <p class="subtitle">DevStarSJ</p>
                        </h2>
                    
                </div>
                <div id="header-inner" class="nav-container">
                    <a id="main-nav-toggle" class="nav-icon fa fa-bars"></a>
                    <div class="nav-container-inner">
                        <ul id="main-nav">
                            
                                <li class="main-nav-list-item" >
                                    <a class="main-nav-list-link" href="/">Home</a>
                                </li>
                            
                                        <ul class="main-nav-list"><li class="main-nav-list-item"><a class="main-nav-list-link" href="/categories/AWS/">AWS</a><ul class="main-nav-list-child"><li class="main-nav-list-item"><a class="main-nav-list-link" href="/categories/AWS/Lambda/">Lambda</a></li></ul></li><li class="main-nav-list-item"><a class="main-nav-list-link" href="/categories/C/">C#</a><ul class="main-nav-list-child"><li class="main-nav-list-item"><a class="main-nav-list-link" href="/categories/C/ASP-NET/">ASP.NET</a></li><li class="main-nav-list-item"><a class="main-nav-list-link" href="/categories/C/ASP-NET-Core/">ASP.NET Core</a></li><li class="main-nav-list-item"><a class="main-nav-list-link" href="/categories/C/C/">C#</a></li></ul></li><li class="main-nav-list-item"><a class="main-nav-list-link" href="/categories/Database/">Database</a><ul class="main-nav-list-child"><li class="main-nav-list-item"><a class="main-nav-list-link" href="/categories/Database/Oracle/">Oracle</a></li><li class="main-nav-list-item"><a class="main-nav-list-link" href="/categories/Database/SQLP/">SQLP</a></li></ul></li><li class="main-nav-list-item"><a class="main-nav-list-link" href="/categories/DevOps/">DevOps</a></li><li class="main-nav-list-item"><a class="main-nav-list-link" href="/categories/JavaScript/">JavaScript</a><ul class="main-nav-list-child"><li class="main-nav-list-item"><a class="main-nav-list-link" href="/categories/JavaScript/Node-JS/">Node.JS</a></li><li class="main-nav-list-item"><a class="main-nav-list-link" href="/categories/JavaScript/TypeScript/">TypeScript</a></li></ul></li><li class="main-nav-list-item"><a class="main-nav-list-link" href="/categories/Python/">Python</a><ul class="main-nav-list-child"><li class="main-nav-list-item"><a class="main-nav-list-link" href="/categories/Python/DoingMathWithPython/">DoingMathWithPython</a></li></ul></li><li class="main-nav-list-item"><a class="main-nav-list-link" href="/categories/Tips/">Tips</a><ul class="main-nav-list-child"><li class="main-nav-list-item"><a class="main-nav-list-link" href="/categories/Tips/macOS/">macOS</a></li></ul></li></ul>
                                    
                                <li class="main-nav-list-item" >
                                    <a class="main-nav-list-link" href="/about/index.html">About</a>
                                </li>
                            
                        </ul>
                        <nav id="sub-nav">
                            <div id="search-form-wrap">

    <form class="search-form">
        <input type="text" class="ins-search-input search-form-input" placeholder="Search" />
        <button type="submit" class="search-form-submit"></button>
    </form>
    <div class="ins-search">
    <div class="ins-search-mask"></div>
    <div class="ins-search-container">
        <div class="ins-input-wrapper">
            <input type="text" class="ins-search-input" placeholder="Type something..." />
            <span class="ins-close ins-selectable"><i class="fa fa-times-circle"></i></span>
        </div>
        <div class="ins-section-wrapper">
            <div class="ins-section-container"></div>
        </div>
    </div>
</div>
<script>
(function (window) {
    var INSIGHT_CONFIG = {
        TRANSLATION: {
            POSTS: 'Posts',
            PAGES: 'Pages',
            CATEGORIES: 'Categories',
            TAGS: 'Tags',
            UNTITLED: '(Untitled)',
        },
        ROOT_URL: '/',
        CONTENT_URL: '/content.json',
    };
    window.INSIGHT_CONFIG = INSIGHT_CONFIG;
})(window);
</script>
<script src="/js/insight.js"></script>

</div>
                        </nav>
                    </div>
                </div>
            </div>
        </div>
    </div>
</header>
        <div class="container">
            <div class="main-body container-inner">
                <div class="main-body-inner">
                    <section id="main">
                        <div class="main-body-header">
    <h1 class="header">
    
    <a class="page-title-link" href="/categories/AWS/">AWS</a><i class="icon fa fa-angle-right"></i><a class="page-title-link" href="/categories/AWS/Lambda/">Lambda</a>
    </h1>
</div>
                        <div class="main-body-content">
                            <article id="post-MonolithToServerless.01" class="article article-single article-type-post" itemscope itemprop="blogPost">
    <div class="article-inner">
        
            <header class="article-header">
                
    
        <h1 class="article-title" itemprop="name">
        Monolith to Serverless using AWS Lambda (1)
        </h1>
    

            </header>
        
        
            <div class="article-meta">
                
    <div class="article-date">
        <a href="/2017/02/23/MonolithToServerless.01/" class="article-date">
            <time datetime="2017-02-22T15:00:00.000Z" itemprop="datePublished">2017-02-23</time>
        </a>
    </div>

                
    <div class="article-tag">
        <i class="fa fa-tag"></i>
        <a class="tag-link" href="/tags/AWS/">AWS</a>, <a class="tag-link" href="/tags/Lambda/">Lambda</a>, <a class="tag-link" href="/tags/Serverless/">Serverless</a>
    </div>

            </div>
        
        
        <div class="article-entry" itemprop="articleBody">
            <h1 id="monolith-to-serverless-using-aws-lambda">Monolith to Serverless using AWS Lambda</h1>
<h2 id="&#xAE30;&#xC874;-&#xBAA8;&#xB178;&#xB9AC;&#xC2A4;-api-&#xC11C;&#xBC84;&#xB97C;-aws-lambda&#xB97C;-&#xC774;&#xC6A9;&#xD558;&#xC5EC;-&#xC11C;&#xBC84;&#xB9AC;&#xC2A4;&#xB85C;-&#xBCC0;&#xACBD;&#xD558;&#xAE30;">&#xAE30;&#xC874; &#xBAA8;&#xB178;&#xB9AC;&#xC2A4; API &#xC11C;&#xBC84;&#xB97C; AWS Lambda&#xB97C; &#xC774;&#xC6A9;&#xD558;&#xC5EC; &#xC11C;&#xBC84;&#xB9AC;&#xC2A4;&#xB85C; &#xBCC0;&#xACBD;&#xD558;&#xAE30;</h2>
<h3 id="&#xD3B8;.-&#xC11C;&#xBC84;&#xB9AC;&#xC2A4;&#xB97C;-&#xD558;&#xB824;&#xB294;-&#xC774;&#xC720;">1&#xD3B8;. &#xC11C;&#xBC84;&#xB9AC;&#xC2A4;&#xB97C; &#xD558;&#xB824;&#xB294; &#xC774;&#xC720;</h3>
<p>&#xCD5C;&#xADFC; &#xC0C8;&#xB85C; &#xC785;&#xC0AC;&#xD55C; &#xACF3;&#xC5D0;&#xC11C; &#xD558;&#xACE0; &#xC788;&#xB294; &#xC791;&#xC5C5;&#xC774; &#xAE30;&#xC874;&#xC758; &#xBAA8;&#xB178;&#xB9AC;&#xC2A4;&#xB85C; &#xC6B4;&#xC601;&#xC911;&#xC774;&#xB358; API Server&#xB97C; &#xC11C;&#xBC84;&#xB9AC;&#xC2A4;&#xB85C; &#xC62E;&#xACA8;&#xAC00;&#xB294; &#xC791;&#xC5C5;&#xC744; &#xD558;&#xACE0; &#xC788;&#xB2E4;. &#xADF8; &#xACFC;&#xC815;&#xC5D0;&#xC11C; &#xACAA;&#xC5C8;&#xB358; &#xC5EC;&#xB7EC;&#xAC00;&#xC9C0; &#xC77C;&#xB4E4;&#xACFC; &#xB098;&#xC758; &#xC0DD;&#xAC01;&#xB4E4;&#xC744; &#xACF5;&#xC720;&#xD558;&#xACE0;&#xC790; &#xD558;&#xB294; &#xCC28;&#xC6D0;&#xC5D0;&#xC11C; &#xD3EC;&#xC2A4;&#xD305;&#xC744; &#xACB0;&#xC2EC;&#xD588;&#xB2E4;.</p>
<p>&#xC694;&#xC998; &#xC720;&#xD589;&#xC911;&#xC778; &#xB2E8;&#xC5B4; &#xC911;&#xC5D0; Serverless Architecture &#xB780; &#xB9D0;&#xC774; &#xC788;&#xB2E4;. &#xC704;&#xD0A4;&#xD53C;&#xB514;&#xC544;&#xC5D0;&#xB294; <a href="https://en.wikipedia.org/wiki/Serverless_computing" target="_blank" rel="external">Serverless computing</a>&#xC73C;&#xB85C; &#xB4E4;&#xC5B4;&#xAC00;&#xBCF4;&#xBA74; &#xC798; &#xC124;&#xBA85;&#xB418;&#xC5B4; &#xC788;&#xB2E4;. &#xC11C;&#xBC84;&#xB9AC;&#xC2A4;&#xAC00; &#xC5B4;&#xB5A4; &#xC7A5;&#xC810;&#xC774; &#xC788;&#xAE38;&#xB798; &#xB2E4;&#xB4E4; &#xC11C;&#xBC84;&#xB9AC;&#xC2A4;, &#xC11C;&#xBC84;&#xB9AC;&#xC2A4; &#xB178;&#xB798;&#xB97C; &#xBD80;&#xB97C;&#xAE4C; ?</p>
<h2 id="&#xC11C;&#xBC84;&#xB9AC;&#xC2A4;&#xC758;-&#xC7A5;&#xC810;-&#xBAA8;&#xB178;&#xB9AC;&#xC2A4;&#xC758;-&#xB2E8;&#xC810;">&#xC11C;&#xBC84;&#xB9AC;&#xC2A4;&#xC758; &#xC7A5;&#xC810; = &#xBAA8;&#xB178;&#xB9AC;&#xC2A4;&#xC758; &#xB2E8;&#xC810;</h2>
<h3 id="&#xC11C;&#xBC84;-&#xC2A4;&#xCF00;&#xC77C;&#xB9C1;&#xC774;-&#xD544;&#xC694;&#xC5C6;&#xB2E4;.">1. &#xC11C;&#xBC84; &#xC2A4;&#xCF00;&#xC77C;&#xB9C1;&#xC774; &#xD544;&#xC694;&#xC5C6;&#xB2E4;.</h3>
<p>&#xC694;&#xC998; &#xC11C;&#xBC84;&#xB97C; &#xC9C1;&#xC811; &#xC6B4;&#xC601;&#xD558;&#xB294; &#xACBD;&#xC6B0;&#xB294; &#xC798; &#xC5C6;&#xACE0; &#xB300;&#xBD80;&#xBD84; &#xD074;&#xB77C;&#xC6B0;&#xB4DC; &#xC11C;&#xBE44;&#xC2A4;&#xB97C; &#xC774;&#xC6A9;&#xD55C;&#xB2E4;. (ex. <a href="https://aws.amazon.com/ec2" target="_blank" rel="external">AWS&#xC758; EC2</a>) &#xC11C;&#xBC84;&#xAC00; &#xC8FD;&#xB294; &#xB300;&#xBD80;&#xBD84;&#xC758; &#xACBD;&#xC6B0;&#xB294; &#xC11C;&#xBC84;&#xAC00; &#xAC10;&#xB2F9;&#xAC00;&#xB2A5;&#xD55C; &#xD1B5;&#xC2E0; &#xB300;&#xC5ED;&#xD3ED;, &#xBA54;&#xBAA8;&#xB9AC; &#xC6A9;&#xB7C9;, &#xCEF4;&#xD4E8;&#xD305; &#xB2A5;&#xB825;&#xC744; &#xB118;&#xC5B4;&#xC11C;&#xB294; &#xC694;&#xCCAD;&#xC774; &#xB4E4;&#xC5B4;&#xC624;&#xB294; &#xACBD;&#xC6B0;&#xC774;&#xB2E4;. &#xB300;&#xBD80;&#xBD84;&#xC758; &#xACBD;&#xC6B0;&#xB294; &#xADF8;&#xB807;&#xAC8C; &#xC694;&#xCCAD;&#xC774; &#xB9CE;&#xC774; &#xB4E4;&#xC5B4;&#xC624;&#xB294; &#xAC83;&#xC5D0; &#xB300;&#xD574;&#xC11C; &#xC5B4;&#xB290; &#xC815;&#xB3C4; &#xC54C; &#xC218; &#xC788;&#xC73C;&#xBBC0;&#xB85C;, &#xBBF8;&#xB9AC; &#xC11C;&#xBC84;&#xB97C; &#xB9CE;&#xC774; &#xB298;&#xB824;&#xB193;&#xC73C;&#xBA74; &#xB41C;&#xB2E4;. &#xADF8;&#xB9AC;&#xACE0; &#xC694;&#xC998;&#xC740; &#xD074;&#xB77C;&#xC6B0;&#xB4DC; &#xC11C;&#xBE44;&#xC2A4; &#xC0C1;&#xC5D0; &#xCEE8;&#xD14C;&#xC774;&#xB108;&#xB97C; &#xC774;&#xC6A9;&#xD574;&#xC11C; &#xC2A4;&#xCF00;&#xC77C;&#xB9C1;&#xD574;&#xC8FC;&#xB294; &#xC11C;&#xBE44;&#xC2A4;&#xB97C; &#xB300;&#xBD80;&#xBD84; &#xC81C;&#xACF5;&#xD574;&#xC8FC;&#xBBC0;&#xB85C;, &#xC624;&#xD1A0; &#xC2A4;&#xCF00;&#xC77C;&#xB9C1;&#xC744; &#xC124;&#xC815;&#xD574; &#xB193;&#xC73C;&#xBA74; &#xD574;&#xACB0;&#xB41C;&#xB2E4;. &#xADF8;&#xB807;&#xAC8C; &#xD558;&#xB354;&#xB77C;&#xB3C4; &#xC7A5;&#xC560;&#xAC00; &#xBC1C;&#xC0DD;&#xD55C;&#xB2E4;.</p>
<p>&#xADF8;&#xB7FC; &#xC5B8;&#xC81C; &#xC5C4;&#xCCAD;&#xB09C; &#xC591;&#xC758; &#xC694;&#xCCAD;&#xC774; &#xAC11;&#xC790;&#xAE30; &#xB4E4;&#xC5B4;&#xC62C;&#xAE4C; ? &#xB300;&#xBD80;&#xBD84;&#xC758; &#xACBD;&#xC6B0;&#xB294; &#xC911;&#xC694;&#xD55C; &#xC2DC;&#xC810;&#xC774;&#xB2E4;. &#xC5EC;&#xAE30;&#xC11C; &#xB9D0;&#xD558;&#xB294; &#xC911;&#xC694;&#xD55C; &#xC2DC;&#xC810;&#xC740; &#xC11C;&#xBE44;&#xC2A4;&#xC5D0; &#xB300;&#xD55C; &#xD64D;&#xBCF4;&#xAC00; &#xB098;&#xAC14;&#xC744; &#xACBD;&#xC6B0;&#xB97C; &#xB9D0;&#xD55C;&#xB2E4;. &#xC9C0;&#xAE08; &#xC811;&#xC18D;&#xD558;&#xBA74; &#xC120;&#xCC29;&#xC21C; &#xBA87;&#xBA85;&#xC5D0;&#xAC8C; &#xCFE0;&#xD3F0; &#xC99D;&#xC815;, PPL&#xC744; &#xD1B5;&#xD574; &#xD574;&#xB2F9; &#xC11C;&#xBE44;&#xC2A4;&#xC5D0; &#xB300;&#xD55C; &#xD64D;&#xBCF4;&#xAC00; &#xBC29;&#xC1A1;&#xC5D0; &#xB098;&#xAC04; &#xACBD;&#xC6B0;, &#xC571;&#xC5D0; &#xD478;&#xC2DC;&#xB97C; &#xBC1C;&#xC1A1;&#xD55C; &#xACBD;&#xC6B0; &#xB4F1;&#xC774; &#xC788;&#xC744; &#xAC83;&#xC774;&#xB2E4;. &#xB9CC;&#xC57D; &#xC624;&#xB298; &#xBC24;&#xC5D0; &#xD558;&#xB294; &#xB4DC;&#xB77C;&#xB9C8;&#xC5D0; PPL&#xB85C; &#xC6B0;&#xB9AC; &#xC11C;&#xBE44;&#xC2A4;&#xAC00; &#xC18C;&#xAC1C;&#xB420; &#xC608;&#xC815;&#xC774;&#xB2E4;. &#xB4DC;&#xB77C;&#xB9C8;&#xAC00; 10&#xC2DC;&#xC5D0; &#xC2DC;&#xC791;&#xD558;&#xACE0;, PPL&#xC774; &#xB098;&#xAC08; &#xC2DC;&#xAC04;&#xC774; &#xB300;&#xB7B5; 10&#xC2DC; 40&#xBD84;&#xCBE4; &#xB420;&#xAC83; &#xAC19;&#xB2E4;&#xACE0; &#xD55C;&#xB2E4;&#xBA74; ??? &#xAD00;&#xB828;&#xC790;&#xB4E4;&#xC740; &#xD1F4;&#xADFC;&#xC744; &#xBABB;&#xD55C;&#xB2E4;. &#xADF8; &#xC2DC;&#xAC04; &#xC774;&#xC804;&#xC5D0; &#xC11C;&#xBC84;&#xB97C; &#xCDA9;&#xBD84;&#xD788; &#xB298;&#xB824;&#xB193;&#xACE0;, &#xACC4;&#xC18D; &#xC11C;&#xBC84; &#xC0C1;&#xD0DC;&#xB97C; &#xBAA8;&#xB2C8;&#xD130;&#xB9C1; &#xD558;&#xACE0; &#xC788;&#xB2E4;&#xAC00;, &#xC694;&#xCCAD;&#xC218;&#xAC00; &#xC904;&#xC5B4;&#xB4E4;&#xBA74; &#xC11C;&#xBC84;&#xB97C; &#xB2E4;&#xC2DC; &#xC904;&#xC774;&#xB358;&#xC9C0; &#xC544;&#xB2C8;&#xBA74; &#xC624;&#xD1A0; &#xC2A4;&#xCF00;&#xC77C;&#xB9C1; &#xC124;&#xC815;&#xC744; &#xC870;&#xC815;&#xD574;&#xC918;&#xC57C; &#xD55C;&#xB2E4;. &#xC624;&#xD1A0; &#xC2A4;&#xCF00;&#xC77C;&#xB9C1; ? &#xADF8;&#xB7FC; &#xC790;&#xB3D9;&#xC73C;&#xB85C; &#xB418;&#xC5B4;&#xC57C; &#xD558;&#xB294;&#xAC83; &#xC544;&#xB2CC;&#xAC00; ? &#xD558;&#xC9C0;&#xB9CC; &#xCEE8;&#xD14C;&#xC774;&#xB108;&#xC5D0; &#xC11C;&#xBC84; &#xC774;&#xBBF8;&#xC9C0;&#xB97C; &#xBCF5;&#xC0AC;&#xD574;&#xC11C; &#xAC00;&#xB3D9;&#xD558;&#xB294;&#xB370; &#xB300;&#xB7B5; 15&#xBD84;&#xC758; &#xC2DC;&#xAC04;&#xC774; &#xAC78;&#xB9B0;&#xB2E4;&#xACE0; &#xAC00;&#xC815;&#xD588;&#xC744; &#xB54C;, 15&#xBD84;&#xB3D9;&#xC548; &#xAE30;&#xC874;&#xC5D0; &#xC2E4;&#xD589;&#xD558;&#xACE0; &#xC788;&#xB358; &#xC11C;&#xBC84;&#xB4E4;&#xC774; &#xC8FD;&#xC9C0;&#xC54A;&#xACE0; &#xC694;&#xCCAD;&#xB4E4;&#xC744; &#xC798; &#xCC98;&#xB9AC;&#xD574; &#xC900;&#xB2E4;&#xBA74; &#xBB38;&#xC81C;&#xAC00; &#xB418;&#xC9C0; &#xC54A;&#xC9C0;&#xB9CC; &#xADF8;&#xB7EC;&#xC9C0; &#xBABB;&#xD560; &#xACBD;&#xC6B0;&#xC5D0;&#xB294; &#xBC14;&#xB85C; &#xC7A5;&#xC560;&#xAC00; &#xBC1C;&#xC0DD;&#xD558;&#xB294;&#xAC70;&#xB2E4;.</p>
<p>&#xADF8;&#xB7FC; &#xADF8;&#xAC8C; &#xBB34;&#xC2A8; &#xC624;&#xD1A0; &#xC2A4;&#xCF00;&#xC77C;&#xB9C1;&#xC774;&#xB0D0; ? &#xB77C;&#xACE0; &#xC0DD;&#xAC01;&#xD560; &#xC218; &#xC788;&#xC9C0;&#xB9CC;, &#xADF8;&#xB7FC; &#xD604;&#xC7AC; &#xC11C;&#xBE44;&#xC2A4;&#xB418;&#xACE0; &#xC788;&#xB294; &#xC11C;&#xBC84;&#xC218;&#xB97C; &#xC5B4;&#xB5BB;&#xAC8C; &#xC124;&#xC815;&#xD560; &#xAC83;&#xC778;&#xAC00; ? &#xC5B8;&#xC81C; &#xC11C;&#xBC84;&#xB97C; &#xB354; &#xB298;&#xB9B4;&#xAC83;&#xC778;&#xAC00; ? &#xC5D0; &#xB300;&#xD55C; &#xACE0;&#xBBFC;&#xC744; &#xC11C;&#xBC84; &#xAD00;&#xB9AC;&#xC790;&#xB294; &#xD56D;&#xC0C1;&#xD574;&#xC57C;&#xD558;&#xB294;&#xB370;, &#xADF8; &#xACE0;&#xBBFC;&#xC5D0;&#xC11C; &#xC5B4;&#xCA4C;&#xBA74; &#xAC00;&#xC7A5; &#xC911;&#xC694;&#xD55C; &#xD3EC;&#xC778;&#xD2B8;&#xB294; &#xBE44;&#xC6A9;&#xC774;&#xB2E4;. &#xC11C;&#xBC84;&#xAC00; &#xC8FD;&#xC9C0; &#xC54A;&#xC73C;&#xBA74;&#xC11C; &#xCD5C;&#xC801;&#xC758; &#xBE44;&#xC6A9;&#xC73C;&#xB85C; &#xC6B4;&#xC601;&#xC744; &#xD558;&#xB294;&#xAC8C; &#xCD5C;&#xB300;&#xD55C;&#xC758; &#xC774;&#xC775;&#xC774; &#xB098;&#xB294; &#xAC83;&#xC774;&#xAE30;&#xC5D0; &#xADF8; &#xC124;&#xC815;&#xC744; &#xCD5C;&#xB300;&#xD55C; &#xD0C0;&#xC774;&#xD2B8;&#xD558;&#xAC8C; &#xD558;&#xB294;&#xAC8C; &#xC88B;&#xB2E4;. &#xB9CC;&#xC57D; &#xC124;&#xC815;&#xC744; &#xC7A5;&#xC560;&#xC5D0; &#xC8FD;&#xC9C0; &#xC54A;&#xB294;&#xAC83;&#xC774; &#xCD5C;&#xACE0;&#xB77C;&#xACE0; &#xC0DD;&#xAC01;&#xD558;&#xACE0; &#xB298; &#xB9CE;&#xC774; &#xB744;&#xC6CC;&#xB193;&#xC73C;&#xBA74; &#xADF8;&#xB9CC;&#xD07C; &#xACFC;&#xAE08;&#xC740; &#xB9CE;&#xC774;&#xB418;&#xACE0; &#xC11C;&#xBC84;&#xB294; &#xB9CE;&#xC740; &#xC2DC;&#xAC04;&#xC744; &#xB180;&#xACE0; &#xC788;&#xAC8C; &#xB41C;&#xB2E4;. &#xC694;&#xCCAD;&#xC5D0; &#xB300;&#xD574;&#xC11C; &#xC2A4;&#xCF00;&#xC77C;&#xB9C1;&#xD558;&#xB294; &#xC815;&#xCC45; &#xC790;&#xCCB4;&#xB97C; &#xB290;&#xC2A8;&#xD558;&#xAC8C; &#xD558;&#xBA74; &#xD3C9;&#xC18C;&#xB77C;&#xB3C4; &#xD55C;&#xC21C;&#xAC04; &#xC694;&#xCCAD;&#xC774; &#xBAB0;&#xB9B4; &#xACBD;&#xC6B0; &#xBC14;&#xB85C; &#xC11C;&#xBC84;&#xB97C; &#xC0C8;&#xB85C; &#xC62C;&#xB9AC;&#xAC8C; &#xB418;&#xACE0;, &#xC62C;&#xB9AC;&#xB294;&#xB370; 15&#xBD84;&#xC774; &#xAC78;&#xB9AC;&#xB294;&#xB370; &#xB9C9;&#xC0C1; 15&#xBD84; &#xB4A4;&#xC5D0;&#xB294; &#xADF8; &#xC11C;&#xBC84;&#xAC00; &#xD544;&#xC694;&#xC5C6;&#xAC8C; &#xB418;&#xB294; &#xACBD;&#xC6B0;&#xAC00; &#xB9CE;&#xC774; &#xBC1C;&#xC0DD;&#xD560; &#xAC83;&#xC774;&#xB2E4;.</p>
<p>&#xC11C;&#xBC84;&#xB9AC;&#xC2A4;&#xB85C; &#xAC04;&#xB2E4;&#xBA74; &#xC2E4;&#xC9C8;&#xC801;&#xC778; &#xC11C;&#xBC84; &#xC6B4;&#xC601;&#xC744; &#xD074;&#xB77C;&#xC6B0;&#xB4DC; &#xC11C;&#xBE44;&#xC2A4; &#xC5C5;&#xCCB4;&#xC5D0;&#xAC8C; &#xC644;&#xC804; &#xB118;&#xAE38;&#xC218; &#xC788;&#xC73C;&#xBBC0;&#xB85C;, &#xC774;&#xB7F0; &#xACE0;&#xD1B5;&#xC5D0;&#xC11C; &#xBC97;&#xC5B4;&#xB0A0; &#xC218; &#xC788;&#xB2E4;. (&#xD558;&#xC9C0;&#xB9CC;, &#xC2E4;&#xC81C;&#xB85C;&#xB294; &#xC774;&#xAC83;&#xB3C4; &#xBAA8;&#xB2C8;&#xD130;&#xB9C1;&#xD574;&#xC57C; &#xD55C;&#xB2E4;. &#xADF8; &#xC774;&#xC720;&#xB294; &#xB4A4;&#xC5D0; &#xB530;&#xB85C; &#xC124;&#xBA85;&#xD558;&#xACA0;&#xB2E4;. &#xC544;&#xC8FC; &#xAC04;&#xB7B5;&#xD558;&#xAC8C;&#xB9CC; &#xC598;&#xAE30;&#xD558;&#xC790;&#xBA74; &#xD074;&#xB77C;&#xC6B0;&#xB4DC; &#xC11C;&#xBE44;&#xC2A4;&#xC5D0;&#xAC8C; &#xC0AC;&#xC6A9;&#xC790;&#xC5D0;&#xAC8C; &#xC11C;&#xBC84;&#xB9AC;&#xC2A4;&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xB420; &#xC790;&#xC6D0;&#xC744; &#xBB34;&#xD55C;&#xD788; &#xC8FC;&#xC9C0;&#xC54A;&#xACE0; &#xC81C;&#xD55C;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC774;&#xB2E4;.)</p>
<h3 id="&#xBE44;&#xC6A9;">2. &#xBE44;&#xC6A9;</h3>
<p>&#xC2F8;&#xB2E4;. &#xB2E4;&#xB978; &#xB9D0;&#xC774; &#xB354; &#xD544;&#xC694;&#xD55C;&#xAC00; ? AWS EC2 &#xC11C;&#xBC84;&#xB85C; &#xC6B4;&#xC601;&#xD558;&#xB294;&#xAC83; &#xBCF4;&#xB2E4; <a href="https://aws.amazon.com/lambda" target="_blank" rel="external">Lambda</a> + <a href="https://aws.amazon.com/api-gateway" target="_blank" rel="external">API Gateway</a>&#xB97C; &#xC774;&#xC6A9;&#xD574;&#xC11C; API&#xB97C; &#xC11C;&#xBE44;&#xC2A4; &#xD574;&#xBCF4;&#xB2C8; &#xD6E8;&#xC52C; &#xB354; &#xC2F8;&#xB2E4;. EC2&#xC758; &#xACBD;&#xC6B0;&#xC5D0;&#xB294; &#xC6B4;&#xC601;&#xC911;&#xC778; &#xC11C;&#xBC84;&#xC218; x &#xC11C;&#xBC84; &#xC778;&#xC2A4;&#xD134;&#xC2A4;&#xC758; &#xBE44;&#xC6A9; x &#xC11C;&#xBC84;&#xAC00; &#xC6B4;&#xC601;&#xC911;&#xC778; &#xAE30;&#xAC04; (1&#xC2DC;&#xAC04; &#xB2E8;&#xC704;)&#xB85C; &#xACFC;&#xAE08;&#xC774; &#xC774;&#xB8E8;&#xC5B4; &#xC9C4;&#xB2E4;. Lambda&#xC758; &#xACBD;&#xC6B0;&#xB294; &#xCF54;&#xB4DC;&#xAC00; &#xC218;&#xD589;&#xB41C; &#xC2DC;&#xAC04;&#xC744; 100ms &#xB2E8;&#xC704;&#xB85C; &#xC62C;&#xB9BC;&#xD558;&#xC5EC; &#xACFC;&#xAE08;&#xD55C;&#xB2E4;. API Gateway&#xC758; &#xACBD;&#xC6B0; 100&#xB9CC; &#xC694;&#xCCAD; &#xB2F9; 3.5 USD&#xAC00; &#xACFC;&#xAE08;&#xB41C;&#xB2E4;. &#xC774;&#xB807;&#xAC8C; &#xBD10;&#xC11C;&#xB294; &#xACFC;&#xC5F0; &#xB354; &#xC2FC;&#xC9C0; &#xBC14;&#xB85C; &#xD310;&#xB2E8;&#xC774; &#xC548;&#xB418;&#xACA0;&#xC9C0;&#xB9CC;, &#xC2E4;&#xC81C;&#xB85C; &#xC6B4;&#xC601;&#xD574;&#xBCF4;&#xB2C8; &#xD6E8;&#xC52C; &#xB354; &#xC2F8;&#xB2E4;. &#xBE44;&#xAD50;&#xB3C4; &#xC548;&#xB418;&#xAC8C; &#xC2F8;&#xB2E4;.</p>
<p>&#xC77C;&#xB2E8; &#xC774; &#xB450;&#xAC00;&#xC9C0;&#xAC00; &#xC9C1;&#xC811; &#xACAA;&#xC5C8;&#xB358; &#xD070; &#xC774;&#xC720;&#xB2E4;. &#xC774;&#xAC83; &#xB9D0;&#xACE0;&#xB3C4; &#xC5EC;&#xB7EC;&#xAC00;&#xC9C0; &#xBC1C;&#xD45C;&#xC790;&#xB8CC;&#xB4E4;&#xC744; &#xCC3E;&#xC544;&#xBCF4;&#xBA74; &#xB2E4;&#xB978; &#xC7A5;&#xC810;&#xB4E4;&#xC774; &#xB9CE;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; &#xADF8;&#xAC74; &#xC635;&#xC158; &#xC0AC;&#xD56D;&#xC778;&#xB4EF; &#xD558;&#xB2E4;.</p>
<h3 id="&#xD3F4;&#xB9AC;&#xADF8;&#xB78F;&#xC774;-&#xAC00;&#xB2A5;">3. &#xD3F4;&#xB9AC;&#xADF8;&#xB78F;&#xC774; &#xAC00;&#xB2A5;</h3>
<p>&#xAC01; API &#xAE30;&#xB2A5;&#xBCC4;&#xB85C; &#xB2E4;&#xB978; &#xC5B8;&#xC5B4;&#xB85C; &#xAC1C;&#xBC1C;&#xC774; &#xAC00;&#xB2A5;&#xD558;&#xB2E4;. &#xB2F9;&#xC5F0;&#xD788; &#xADF8;&#xB807;&#xACA0;&#xC9C0;. &#xAC01;&#xAC01; &#xB530;&#xB85C; &#xB514;&#xD50C;&#xB85C;&#xC774; &#xB418;&#xC5B4;&#xC11C; &#xAD00;&#xB9AC;&#xB418;&#xB2C8;&#xAE50;&#x2026; &#xD558;&#xC9C0;&#xB9CC; &#xADF8;&#xB807;&#xAC8C; &#xAC01;&#xAC01;&#xC758; API&#xB97C; &#xC11C;&#xB85C; &#xB2E4;&#xB978; &#xC5B8;&#xC5B4;&#xB85C; &#xC11C;&#xB85C; &#xB2E4;&#xB978; &#xD504;&#xB808;&#xC784;&#xC6CC;&#xD06C;&#xB97C; &#xC368;&#xC11C; &#xB9CC;&#xB4E4;&#xC5B4; &#xC62C;&#xB9AC;&#xBA74; &#xAD00;&#xB9AC;&#xB294; &#xB204;&#xAC00;&#xD558;&#xB098; ? &#xC815;&#xB9D0; &#xAE09;&#xD558;&#xAC8C; &#xC11C;&#xBE44;&#xC2A4;&#xD574;&#xC57C; &#xB418;&#xC5B4;&#xC11C; &#xC544;&#xC6C3;&#xC18C;&#xC2F1;&#xC73C;&#xB85C; &#xAC00;&#xC7A5; &#xC790;&#xC2E0;&#xC788;&#xB294; &#xC5B8;&#xC5B4;&#xB85C; &#xCD5C;&#xB300;&#xD55C; &#xBE68;&#xB9AC; &#xD574;&#xC8FC;&#xC138;&#xC694;. &#xAC00; &#xC544;&#xB2CC; &#xC774;&#xC0C1; &#xD55C; &#xC870;&#xC9C1;&#xC5D0;&#xC11C; &#xC774;&#xB807;&#xAC8C; &#xD588;&#xC744;&#xB54C; &#xACFC;&#xC5F0; &#xC7A5;&#xC810;&#xC774; &#xB354; &#xD074;&#xC9C0; &#xB2E8;&#xC810;&#xC774; &#xB354; &#xD074;&#xC9C0;&#x2026; &#xC544;&#xB2C8;&#xBA74; &#xAC1C;&#xBC1C; &#xC870;&#xC9C1;&#xC774; &#xC5C4;&#xCCAD;&#xB098;&#xAC8C; &#xD06C;&#xACE0;, API &#xAC1C;&#xBC1C;&#xC790;&#xAC00; &#xC218;&#xC2ED;&#xBA85; &#xC788;&#xC744; &#xACBD;&#xC6B0;&#xB77C;&#xBA74; &#xB098;&#xB984; &#xAD1C;&#xCC2E;&#xC744;&#xAC83; &#xAC19;&#xAE30;&#xB3C4; &#xD558;&#xB2E4;. &#xB2F9;&#xC7A5; &#xB098;&#xC758; &#xACBD;&#xC6B0;&#xB9CC; &#xBCF4;&#xB354;&#xB77C;&#xB3C4; &#xAC00;&#xC7A5; &#xC790;&#xC2E0;&#xC788;&#xACE0; &#xAC00;&#xC7A5; &#xBE68;&#xB9AC; &#xAC1C;&#xBC1C;&#xC774; &#xAC00;&#xB2A5;&#xD55C; &#xC5B8;&#xC5B4;&#xB294; C# &#xC774;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; Node.JS &#xB85C; API&#xB97C; &#xAC1C;&#xBC1C; &#xC911;&#xC774;&#xB2E4;. (&#xC5EC;&#xAE30;&#xC5D0;&#xB294; &#xB2E4;&#xB978; &#xC774;&#xC720;&#xB3C4; &#xC788;&#xAE34;&#xC788;&#xB2E4;. &#xC544;&#xC9C1; AWS Lambda&#xC5D0;&#xC11C; .Net CORE &#xC9C0;&#xC6D0;&#xC774; &#xBBFF;&#xC744;&#xB9CC;&#xD55C; &#xC218;&#xC900;&#xC740; &#xC544;&#xB2C8;&#xB77C;&#xC11C;&#x2026;)</p>
<p>&#xC774; &#xCBE4;&#xB418;&#xBA74; &#xC11C;&#xBC84;&#xB9AC;&#xC2A4;&#xB97C; &#xC548; &#xD560; &#xC774;&#xC720;&#xAC00; &#xC5C6;&#xC5B4;&#xBCF4;&#xC778;&#xB2E4;. &#xC815;&#xB9D0;&#xB85C; &#xADF8;&#xB807;&#xAC8C; &#xC0DD;&#xAC01;&#xC774; &#xB4E0;&#xB2E4;&#xBA74;&#x2026; &#xC77C;&#xB2E8; &#xC11C;&#xBC84;&#xB9AC;&#xC2A4; &#xC57D;&#xC744; &#xD30C;&#xB294;&#xB370; &#xC870;&#xAE08;&#xC740; &#xC131;&#xACF5;&#xD588;&#xB2E8; &#xC0DD;&#xAC01;&#xC774; &#xB4E0;&#xB2E4;. &#xC73C;&#xD750;&#xD750;&#x2026;.</p>
<h2 id="serverless&#xB85C;-&#xAC08;&#xC544;&#xD0C0;&#xAE30;-&#xC704;&#xD55C;-&#xC870;&#xAC74;">Serverless&#xB85C; &#xAC08;&#xC544;&#xD0C0;&#xAE30; &#xC704;&#xD55C; &#xC870;&#xAC74;</h2>
<p>&#xC774;&#xBBF8; &#xC815;&#xC0C1;&#xC801;&#xC73C;&#xB85C; &#xC11C;&#xBE44;&#xC2A4;&#xB418;&#xACE0; &#xC788;&#xB294; API&#xB97C; &#xC62E;&#xACA8;&#xC57C; &#xD558;&#xB294; &#xC791;&#xC5C5;&#xC774;&#xB2E4;&#xBCF4;&#xB2C8; &#xAC00;&#xC7A5; &#xC911;&#xC694;&#xD55C; &#xAC83;&#xC740; &#xC11C;&#xBE44;&#xC2A4;&#xC5D0; &#xC9C0;&#xC7A5;&#xC744; &#xC8FC;&#xC9C0; &#xC54A;&#xC544;&#xC57C; &#xD55C;&#xB2E4;&#xB294; &#xC810;&#xC774;&#xB2E4;. &#xADF8;&#xAC78; &#xC5B4;&#xB5BB;&#xAC8C; &#xD655;&#xC2E0; &#xD560; &#xC218; &#xC788;&#xC744;&#xAE4C; ?</p>
<ol style="list-style-type: decimal">
<li>&#xD14C;&#xC2A4;&#xD2B8;&#xB97C; &#xC644;&#xBCBD;&#xD558;&#xAC8C; &#xAF3C;&#xAF3C;&#xD558;&#xAC8C; &#xC798; &#xD574;&#xC11C; &#xAE30;&#xC874; API&#xC640; &#xB611;&#xAC19;&#xC774; &#xB3D9;&#xC791;&#xD558;&#xB294; &#xAC83;&#xC744; &#xC99D;&#xBA85;&#xD574; &#xB0B8;&#xB2E4;.</li>
<li>&#xC0C8;&#xB85C; &#xC62C;&#xB9B0; API&#xAC00; &#xC798;&#xBABB;&#xB418;&#xC5C8;&#xC744; &#xB54C; (&#xD55C;&#xB9C8;&#xB514;&#xB85C; &#xC7A5;&#xC560;&#xAC00; &#xB0AC;&#xC744; &#xB54C;) &#xB2E4;&#xC2DC; &#xB418;&#xB3CC;&#xB9AC;&#xB294;&#xB370; &#xAC78;&#xB9AC;&#xB294; &#xC2DC;&#xAC04;&#xC744; &#xCD5C;&#xC18C;&#xD654; &#xD55C;&#xB2E4;.</li>
</ol>
<p>&#xC774; &#xB450; &#xAC00;&#xC9C0; &#xC810;&#xC5D0; &#xB300;&#xD574;&#xC11C; &#xD655;&#xC2E4;&#xD55C; &#xACC4;&#xD68D;&#xC744; &#xC138;&#xC6CC;&#xC11C; &#xACB0;&#xC815;&#xAD8C;&#xC790;&#xB97C; &#xC124;&#xB4DD;&#xC2DC;&#xCF1C;&#xC57C; &#xD55C;&#xB2E4;. &#xC644;&#xBCBD;&#xD55C; &#xD14C;&#xC2A4;&#xD2B8;&#xB294; &#xC77C;&#xB2E8; &#xD3EC;&#xAE30;&#xD588;&#xB2E4;. &#xD3EC;&#xAE30;&#xD55C; &#xAC00;&#xC7A5; &#xD070; &#xC774;&#xC720;&#xB294; &#xC77C;&#xB2E8; &#xC2DC;&#xAC04;&#xC774;&#xB2E4;. &#xC774; &#xC791;&#xC5C5;&#xC740; &#xC0AC;&#xC5C5;&#xC801;&#xC778; &#xCE21;&#xBA74;&#xC5D0;&#xC11C; &#xBD24;&#xC744;&#xB550; &#xC804;&#xD600; &#xD544;&#xC694;&#xC5C6;&#xB294; &#xC791;&#xC5C5;&#xC77C; &#xC218;&#xB3C4; &#xC788;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xAE34; &#xC2DC;&#xAC04;&#xC744; &#xB4E4;&#xC5EC;&#xC11C; &#xC791;&#xC5C5;&#xD558;&#xAE30; &#xD798;&#xB4E4;&#xB2E4;. &#xC0AC;&#xC2E4;&#xC0C1; &#xD68C;&#xC0AC;&#xB0B4;&#xC758; &#xAC1C;&#xBC1C;&#xD300;&#xC774; &#xC544;&#xB2CC; &#xB2E4;&#xB978; &#xC0AC;&#xB78C;&#xB4E4;&#xC774; &#xBD24;&#xC744; &#xB550; &#xADF8;&#xB0E5; &#xC0AC;&#xC5C5;&#xC801;&#xC778; &#xC601;&#xC5ED; &#xD558;&#xB098;&#xB97C; &#xB9E1;&#xC544;&#xC11C; &#xC9C4;&#xD589;&#xD558;&#xB294;&#xAC8C; &#xC544;&#xB2C8;&#xB77C;&#xC11C;, &#xADF8;&#xB0E5; &#xC544;&#xBB34;&#xAC83;&#xB3C4; &#xC548;&#xD558;&#xACE0; &#xB180;&#xACE0; &#xC788;&#xB294; &#xAC78;&#xB85C; &#xBCF4;&#xC77C; &#xC218;&#xB3C4; &#xC788;&#xB2E4;. &#xADF8;&#xB9AC;&#xACE0; &#xC544;&#xBB34;&#xB9AC; &#xD14C;&#xC2A4;&#xD2B8;&#xB97C; &#xC644;&#xBCBD;&#xD558;&#xAC8C; &#xD55C;&#xB2E4;&#xACE0; &#xD55C;&#xB4E4; &#xADF8;&#xB807;&#xB2E4;&#xACE0; &#xC7A5;&#xC560; &#xB300;&#xC751;&#xC5D0; &#xB300;&#xD574;&#xC11C; &#xC804;&#xD600; &#xC0DD;&#xAC01;&#xC744; &#xC548;&#xD574;&#xB3C4; &#xB418;&#xB294;&#xAC8C; &#xC544;&#xB2C8;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC644;&#xBCBD;&#xD55C; &#xD14C;&#xC2A4;&#xD2B8;&#xB294; &#xD3EC;&#xAE30;&#xD558;&#xACE0; &#xC7A5;&#xC560; &#xB300;&#xC751; &#xC2DC;&#xAC04; &#xCD5C;&#xC18C;&#xD654;&#xC5D0; &#xC880; &#xB354; &#xCD1B;&#xC810;&#xC744; &#xB9DE;&#xCDB0;&#xC11C; &#xC900;&#xBE44;&#xB97C; &#xC2DC;&#xC791;&#xD588;&#xB2E4;. (&#xC2E4;&#xC81C; &#xC791;&#xC5C5;&#xC5D0; &#xB4E4;&#xC5B4;&#xAC04; &#xB4A4;&#xC5D0; &#xC54C;&#xAC8C;&#xB41C; &#xC810;&#xC774;&#xC9C0;&#xB9CC;, &#xC7A5;&#xC560; &#xD3EC;&#xC778;&#xD2B8;&#xAC00; API&#xB97C; &#xC798;&#xBABB; &#xC62E;&#xAE34; &#xAC83;&#xBCF4;&#xB2E4;&#xB294; AWS &#xB0B4;&#xBD80;&#xC801;&#xC778; &#xBB38;&#xC81C;&#xAC00; &#xD6E8;&#xC52C; &#xB354; &#xCEF8;&#xC5C8;&#xB2E4;. &#xB9DD;&#xD560;&#xB188;&#xC758; &#xB9AC;&#xBBF8;&#xD2B8;&#x2026; &#xB04A;&#xC784;&#xC5C6;&#xB294; &#xB9AC;&#xBBF8;&#xD2B8;&#x2026; &#xB9AC;&#xBBF8;&#xD2B8; &#xB4A4;&#xC5D0; &#xC228;&#xC5B4;&#xC788;&#xB294; &#xB2E4;&#xB978; &#xB9AC;&#xBBF8;&#xD2B8;&#x2026;)</p>
<p>&#xC7A5;&#xC560; &#xB300;&#xC751; &#xD50C;&#xB79C;&#xC5D0; &#xB300;&#xD574;&#xC11C;&#xB294; &#xB2E4;&#xC74C; &#xAE00;&#xC5D0;&#xC11C; &#xC880; &#xB354; &#xC790;&#xC138;&#xD788; &#xC124;&#xBA85;&#xD558;&#xACA0;&#xB2E4;.</p>
<p><a href="https://github.com/DevStarSJ/Study/blob/master/Blog/Cloud/AWS/Serverless/MonolithToServerless.02.md" target="_blank" rel="external">&#xB2E4;&#xC74C;&#xAE00; : 2&#xD3B8;. &#xC7A5;&#xC560; &#xB300;&#xC751; &#xD50C;&#xB79C;</a><br>
<a href="https://github.com/DevStarSJ/Study/blob/master/Blog/Cloud/AWS/Serverless/MonolithToServerless.03.md" target="_blank" rel="external">&#xB2E4;&#xC74C;&#xAE00; : 3&#xD3B8;. Lambda &#xBC30;&#xD3EC; &#xD6C4; &#xACAA;&#xAC8C;&#xB418;&#xB294; &#xC77C;&#xB4E4;</a></p>

        </div>
        <footer class="article-footer">
            



    <a data-url="http://DevStarSJ.github.io/2017/02/23/MonolithToServerless.01/" data-id="cj24303210053kc7bhyi1agcx" class="article-share-link"><i class="fa fa-share"></i>Share</a>
<script>
    (function ($) {
        $('body').on('click', function() {
            $('.article-share-box.on').removeClass('on');
        }).on('click', '.article-share-link', function(e) {
            e.stopPropagation();

            var $this = $(this),
                url = $this.attr('data-url'),
                encodedUrl = encodeURIComponent(url),
                id = 'article-share-box-' + $this.attr('data-id'),
                offset = $this.offset(),
                box;

            if ($('#' + id).length) {
                box = $('#' + id);

                if (box.hasClass('on')){
                    box.removeClass('on');
                    return;
                }
            } else {
                var html = [
                    '<div id="' + id + '" class="article-share-box">',
                        '<input class="article-share-input" value="' + url + '">',
                        '<div class="article-share-links">',
                            '<a href="https://twitter.com/intent/tweet?url=' + encodedUrl + '" class="article-share-twitter" target="_blank" title="Twitter"></a>',
                            '<a href="https://www.facebook.com/sharer.php?u=' + encodedUrl + '" class="article-share-facebook" target="_blank" title="Facebook"></a>',
                            '<a href="http://pinterest.com/pin/create/button/?url=' + encodedUrl + '" class="article-share-pinterest" target="_blank" title="Pinterest"></a>',
                            '<a href="https://plus.google.com/share?url=' + encodedUrl + '" class="article-share-google" target="_blank" title="Google+"></a>',
                        '</div>',
                    '</div>'
                ].join('');

              box = $(html);

              $('body').append(box);
            }

            $('.article-share-box.on').hide();

            box.css({
                top: offset.top + 25,
                left: offset.left
            }).addClass('on');

        }).on('click', '.article-share-box', function (e) {
            e.stopPropagation();
        }).on('click', '.article-share-box-input', function () {
            $(this).select();
        }).on('click', '.article-share-box-link', function (e) {
            e.preventDefault();
            e.stopPropagation();

            window.open(this.href, 'article-share-box-window-' + Date.now(), 'width=500,height=450');
        });
    })(jQuery);
</script>

        </footer>
    </div>
</article>

    <section id="comments">
    
        
    <div id="disqus_thread">
        <noscript>Please enable JavaScript to view the <a href="//disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
    </div>

    
    </section>


                        </div>
                    </section>
                    <aside id="sidebar">
    <a class="sidebar-toggle" title="Expand Sidebar"><i class="toggle icon"></i></a>
    <div class="sidebar-top">
        <p>follow:</p>
        <ul class="social-links">
            
                
                <li>
                    <a class="social-tooltip" title="facebook-square" href="https://www.facebook.com/seokjoon.yun.9" target="_blank">
                        <i class="icon fa fa-facebook-square"></i>
                    </a>
                </li>
                
            
                
                <li>
                    <a class="social-tooltip" title="github" href="https://github.com/DevStarSJ" target="_blank">
                        <i class="icon fa fa-github"></i>
                    </a>
                </li>
                
            
                
                <li>
                    <a class="social-tooltip" title="slideshare" href="https://www.slideshare.net/seokjoonyun9" target="_blank">
                        <i class="icon fa fa-slideshare"></i>
                    </a>
                </li>
                
            
                
                <li>
                    <a class="social-tooltip" title="linkedin-square" href="https://www.linkedin.com/in/sjyun" target="_blank">
                        <i class="icon fa fa-linkedin-square"></i>
                    </a>
                </li>
                
            
                
                <li>
                    <a class="social-tooltip" title="google-plus" href="https://plus.google.com/u/1/108379332089647292574" target="_blank">
                        <i class="icon fa fa-google-plus"></i>
                    </a>
                </li>
                
            
        </ul>
    </div>
    
        
<nav id="article-nav">
    
        <a href="/2017/02/25/MonolithToServerless.02/" id="article-nav-newer" class="article-nav-link-wrap">
        <strong class="article-nav-caption">newer</strong>
        <p class="article-nav-title">
        
            Monolith to Serverless using AWS Lambda (2)
        
        </p>
        <i class="icon fa fa-chevron-right" id="icon-chevron-right"></i>
    </a>
    
    
        <a href="/2017/01/23/CSharp.Aspnet.RequestBodyLog/" id="article-nav-older" class="article-nav-link-wrap">
        <strong class="article-nav-caption">older</strong>
        <p class="article-nav-title">Get Request Body in Action Method</p>
        <i class="icon fa fa-chevron-left" id="icon-chevron-left"></i>
        </a>
    
</nav>

    
    <div class="widgets-container">
        
            
                
    <div class="widget-wrap widget-list">
        <h3 class="widget-title">categories</h3>
        <div class="widget">
            <ul class="category-list"><li class="category-list-item"><a class="category-list-link" href="/categories/AWS/">AWS</a><span class="category-list-count">14</span><ul class="category-list-child"><li class="category-list-item"><a class="category-list-link" href="/categories/AWS/Lambda/">Lambda</a><span class="category-list-count">14</span></li></ul></li><li class="category-list-item"><a class="category-list-link" href="/categories/C/">C#</a><span class="category-list-count">15</span><ul class="category-list-child"><li class="category-list-item"><a class="category-list-link" href="/categories/C/ASP-NET/">ASP.NET</a><span class="category-list-count">6</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/C/ASP-NET-Core/">ASP.NET Core</a><span class="category-list-count">4</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/C/C/">C#</a><span class="category-list-count">5</span></li></ul></li><li class="category-list-item"><a class="category-list-link" href="/categories/Database/">Database</a><span class="category-list-count">23</span><ul class="category-list-child"><li class="category-list-item"><a class="category-list-link" href="/categories/Database/Oracle/">Oracle</a><span class="category-list-count">2</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Database/SQLP/">SQLP</a><span class="category-list-count">21</span></li></ul></li><li class="category-list-item"><a class="category-list-link" href="/categories/DevOps/">DevOps</a><span class="category-list-count">2</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/JavaScript/">JavaScript</a><span class="category-list-count">3</span><ul class="category-list-child"><li class="category-list-item"><a class="category-list-link" href="/categories/JavaScript/Node-JS/">Node.JS</a><span class="category-list-count">1</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/JavaScript/TypeScript/">TypeScript</a><span class="category-list-count">2</span></li></ul></li><li class="category-list-item"><a class="category-list-link" href="/categories/Python/">Python</a><span class="category-list-count">1</span><ul class="category-list-child"><li class="category-list-item"><a class="category-list-link" href="/categories/Python/DoingMathWithPython/">DoingMathWithPython</a><span class="category-list-count">1</span></li></ul></li><li class="category-list-item"><a class="category-list-link" href="/categories/Tips/">Tips</a><span class="category-list-count">1</span><ul class="category-list-child"><li class="category-list-item"><a class="category-list-link" href="/categories/Tips/macOS/">macOS</a><span class="category-list-count">1</span></li></ul></li></ul>
        </div>
    </div>


            
                
    <div class="widget-wrap widget-float">
        <h3 class="widget-title">tag cloud</h3>
        <div class="widget tagcloud">
            <a href="/tags/APIGateway/" style="font-size: 16.67px;">APIGateway</a> <a href="/tags/ASP-NET/" style="font-size: 15.56px;">ASP.NET</a> <a href="/tags/ASP-NET-Core/" style="font-size: 13.33px;">ASP.NET Core</a> <a href="/tags/AWS/" style="font-size: 17.78px;">AWS</a> <a href="/tags/C/" style="font-size: 18.89px;">C#</a> <a href="/tags/CI-CD/" style="font-size: 11.11px;">CI/CD</a> <a href="/tags/Database/" style="font-size: 20px;">Database</a> <a href="/tags/DevOps/" style="font-size: 11.11px;">DevOps</a> <a href="/tags/JavaScript/" style="font-size: 12.22px;">JavaScript</a> <a href="/tags/Lambda/" style="font-size: 17.78px;">Lambda</a> <a href="/tags/Math/" style="font-size: 10px;">Math</a> <a href="/tags/Node-JS/" style="font-size: 14.44px;">Node.JS</a> <a href="/tags/Oracle/" style="font-size: 20px;">Oracle</a> <a href="/tags/Python/" style="font-size: 13.33px;">Python</a> <a href="/tags/SQLP/" style="font-size: 20px;">SQLP</a> <a href="/tags/Serverless/" style="font-size: 12.22px;">Serverless</a> <a href="/tags/TypeScript/" style="font-size: 11.11px;">TypeScript</a> <a href="/tags/macOS/" style="font-size: 10px;">macOS</a>
        </div>
    </div>


            
                
    <div class="widget-wrap widget-list">
        <h3 class="widget-title">links</h3>
        <div class="widget">
            <ul>
                
                    <li>
                        <a href="http://hexo.io">Hexo</a>
                    </li>
                
            </ul>
        </div>
    </div>


            
        
    </div>
</aside>
                </div>
            </div>
        </div>
        <footer id="footer">
    <div class="container">
        <div class="container-inner">
            <a id="back-to-top" href="javascript:;"><i class="icon fa fa-angle-up"></i></a>
            <div class="credit">
                <h1 class="logo-wrap">
                    <a href="/" class="logo"></a>
                </h1>
                <p>&copy; 2017 Yun Seok-joon</p>
                <p>Powered by <a href="//hexo.io/" target="_blank">Hexo</a>. Theme by <a href="//github.com/ppoffice" target="_blank">PPOffice</a></p>
            </div>
        </div>
    </div>
</footer>
        
    
    <script>
    var disqus_shortname = 'hexo-theme-hueman';
    
    
    var disqus_url = 'http://DevStarSJ.github.io/2017/02/23/MonolithToServerless.01/';
    
    (function() {
    var dsq = document.createElement('script');
    dsq.type = 'text/javascript';
    dsq.async = true;
    dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
    (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
    })();
    </script>




    
        <script src="/libs/lightgallery/js/lightgallery.min.js"></script>
        <script src="/libs/lightgallery/js/lg-thumbnail.min.js"></script>
        <script src="/libs/lightgallery/js/lg-pager.min.js"></script>
        <script src="/libs/lightgallery/js/lg-autoplay.min.js"></script>
        <script src="/libs/lightgallery/js/lg-fullscreen.min.js"></script>
        <script src="/libs/lightgallery/js/lg-zoom.min.js"></script>
        <script src="/libs/lightgallery/js/lg-hash.min.js"></script>
        <script src="/libs/lightgallery/js/lg-share.min.js"></script>
        <script src="/libs/lightgallery/js/lg-video.min.js"></script>
    
    
        <script src="/libs/justified-gallery/jquery.justifiedGallery.min.js"></script>
    
    


<!-- Custom Scripts -->
<script src="/js/main.js"></script>

    </div><!-- hexo-inject:begin --><!-- hexo-inject:end -->
</body>
</html>
