<!DOCTYPE html>
<html>
<head>
    <!-- hexo-inject:begin --><!-- hexo-inject:end --><meta charset="utf-8">
    
    <title>Monolith to Serverless using AWS Lambda (3) | Dev Star SJ</title>
    <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
    
        <meta name="keywords" content="AWS,Lambda,Serverless" />
    
    <meta name="description" content="Monolith to Serverless using AWS Lambda &amp;#xAE30;&amp;#xC874; &amp;#xBAA8;&amp;#xB178;&amp;#xB9AC;&amp;#xC2A4; API &amp;#xC11C;&amp;#xBC84;&amp;#xB97C; AWS Lambda&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xC11C;&amp;#xBC84;&amp;#xB9AC;&amp;#xC2">
<meta name="keywords" content="AWS,Lambda,Serverless">
<meta property="og:type" content="article">
<meta property="og:title" content="Monolith to Serverless using AWS Lambda (3)">
<meta property="og:url" content="http://DevStarSJ.github.io/2017/02/26/MonolithToServerless.03/index.html">
<meta property="og:site_name" content="Dev Star SJ">
<meta property="og:description" content="Monolith to Serverless using AWS Lambda &amp;#xAE30;&amp;#xC874; &amp;#xBAA8;&amp;#xB178;&amp;#xB9AC;&amp;#xC2A4; API &amp;#xC11C;&amp;#xBC84;&amp;#xB97C; AWS Lambda&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xC11C;&amp;#xBC84;&amp;#xB9AC;&amp;#xC2">
<meta property="og:updated_time" content="2017-04-23T09:32:51.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="Monolith to Serverless using AWS Lambda (3)">
<meta name="twitter:description" content="Monolith to Serverless using AWS Lambda &amp;#xAE30;&amp;#xC874; &amp;#xBAA8;&amp;#xB178;&amp;#xB9AC;&amp;#xC2A4; API &amp;#xC11C;&amp;#xBC84;&amp;#xB97C; AWS Lambda&amp;#xB97C; &amp;#xC774;&amp;#xC6A9;&amp;#xD558;&amp;#xC5EC; &amp;#xC11C;&amp;#xBC84;&amp;#xB9AC;&amp;#xC2">
    

    

    

    <link rel="stylesheet" href="/libs/font-awesome/css/font-awesome.min.css">
    <link rel="stylesheet" href="/libs/titillium-web/styles.css">
    <link rel="stylesheet" href="/libs/source-code-pro/styles.css">

    <link rel="stylesheet" href="/css/style.css">

    <script src="/libs/jquery/2.0.3/jquery.min.js"></script>
    
    
        <link rel="stylesheet" href="/libs/lightgallery/css/lightgallery.min.css">
    
    
        <link rel="stylesheet" href="/libs/justified-gallery/justifiedGallery.min.css"><!-- hexo-inject:begin --><!-- hexo-inject:end -->
    
    
    

</head>

<body>
    <!-- hexo-inject:begin --><!-- hexo-inject:end --><div id="wrap">
        <header id="header">
    <div id="header-outer" class="outer">
        <div class="container">
            <div class="container-inner">
                <div id="header-title">
                    <h1 class="logo-wrap">
                        <a href="/" class="logo"></a>
                    </h1>
                    
                        <h2 class="subtitle-wrap">
                            <p class="subtitle">DevStarSJ</p>
                        </h2>
                    
                </div>
                <div id="header-inner" class="nav-container">
                    <a id="main-nav-toggle" class="nav-icon fa fa-bars"></a>
                    <div class="nav-container-inner">
                        <ul id="main-nav">
                            
                                <li class="main-nav-list-item" >
                                    <a class="main-nav-list-link" href="/">Home</a>
                                </li>
                            
                                        <ul class="main-nav-list"><li class="main-nav-list-item"><a class="main-nav-list-link" href="/categories/AWS/">AWS</a><ul class="main-nav-list-child"><li class="main-nav-list-item"><a class="main-nav-list-link" href="/categories/AWS/Lambda/">Lambda</a></li></ul></li><li class="main-nav-list-item"><a class="main-nav-list-link" href="/categories/C/">C#</a><ul class="main-nav-list-child"><li class="main-nav-list-item"><a class="main-nav-list-link" href="/categories/C/ASP-NET/">ASP.NET</a></li><li class="main-nav-list-item"><a class="main-nav-list-link" href="/categories/C/ASP-NET-Core/">ASP.NET Core</a></li><li class="main-nav-list-item"><a class="main-nav-list-link" href="/categories/C/C/">C#</a></li></ul></li><li class="main-nav-list-item"><a class="main-nav-list-link" href="/categories/Database/">Database</a><ul class="main-nav-list-child"><li class="main-nav-list-item"><a class="main-nav-list-link" href="/categories/Database/Oracle/">Oracle</a></li><li class="main-nav-list-item"><a class="main-nav-list-link" href="/categories/Database/SQLP/">SQLP</a></li></ul></li><li class="main-nav-list-item"><a class="main-nav-list-link" href="/categories/DevOps/">DevOps</a></li><li class="main-nav-list-item"><a class="main-nav-list-link" href="/categories/JavaScript/">JavaScript</a><ul class="main-nav-list-child"><li class="main-nav-list-item"><a class="main-nav-list-link" href="/categories/JavaScript/Node-JS/">Node.JS</a></li><li class="main-nav-list-item"><a class="main-nav-list-link" href="/categories/JavaScript/TypeScript/">TypeScript</a></li></ul></li><li class="main-nav-list-item"><a class="main-nav-list-link" href="/categories/Python/">Python</a><ul class="main-nav-list-child"><li class="main-nav-list-item"><a class="main-nav-list-link" href="/categories/Python/DoingMathWithPython/">DoingMathWithPython</a></li></ul></li><li class="main-nav-list-item"><a class="main-nav-list-link" href="/categories/Tips/">Tips</a><ul class="main-nav-list-child"><li class="main-nav-list-item"><a class="main-nav-list-link" href="/categories/Tips/macOS/">macOS</a></li></ul></li></ul>
                                    
                                <li class="main-nav-list-item" >
                                    <a class="main-nav-list-link" href="/about/index.html">About</a>
                                </li>
                            
                        </ul>
                        <nav id="sub-nav">
                            <div id="search-form-wrap">

    <form class="search-form">
        <input type="text" class="ins-search-input search-form-input" placeholder="Search" />
        <button type="submit" class="search-form-submit"></button>
    </form>
    <div class="ins-search">
    <div class="ins-search-mask"></div>
    <div class="ins-search-container">
        <div class="ins-input-wrapper">
            <input type="text" class="ins-search-input" placeholder="Type something..." />
            <span class="ins-close ins-selectable"><i class="fa fa-times-circle"></i></span>
        </div>
        <div class="ins-section-wrapper">
            <div class="ins-section-container"></div>
        </div>
    </div>
</div>
<script>
(function (window) {
    var INSIGHT_CONFIG = {
        TRANSLATION: {
            POSTS: 'Posts',
            PAGES: 'Pages',
            CATEGORIES: 'Categories',
            TAGS: 'Tags',
            UNTITLED: '(Untitled)',
        },
        ROOT_URL: '/',
        CONTENT_URL: '/content.json',
    };
    window.INSIGHT_CONFIG = INSIGHT_CONFIG;
})(window);
</script>
<script src="/js/insight.js"></script>

</div>
                        </nav>
                    </div>
                </div>
            </div>
        </div>
    </div>
</header>
        <div class="container">
            <div class="main-body container-inner">
                <div class="main-body-inner">
                    <section id="main">
                        <div class="main-body-header">
    <h1 class="header">
    
    <a class="page-title-link" href="/categories/AWS/">AWS</a><i class="icon fa fa-angle-right"></i><a class="page-title-link" href="/categories/AWS/Lambda/">Lambda</a>
    </h1>
</div>
                        <div class="main-body-content">
                            <article id="post-MonolithToServerless.03" class="article article-single article-type-post" itemscope itemprop="blogPost">
    <div class="article-inner">
        
            <header class="article-header">
                
    
        <h1 class="article-title" itemprop="name">
        Monolith to Serverless using AWS Lambda (3)
        </h1>
    

            </header>
        
        
            <div class="article-meta">
                
    <div class="article-date">
        <a href="/2017/02/26/MonolithToServerless.03/" class="article-date">
            <time datetime="2017-02-25T15:00:00.000Z" itemprop="datePublished">2017-02-26</time>
        </a>
    </div>

                
    <div class="article-tag">
        <i class="fa fa-tag"></i>
        <a class="tag-link" href="/tags/AWS/">AWS</a>, <a class="tag-link" href="/tags/Lambda/">Lambda</a>, <a class="tag-link" href="/tags/Serverless/">Serverless</a>
    </div>

            </div>
        
        
        <div class="article-entry" itemprop="articleBody">
            <h1 id="monolith-to-serverless-using-aws-lambda">Monolith to Serverless using AWS Lambda</h1>
<h2 id="&#xAE30;&#xC874;-&#xBAA8;&#xB178;&#xB9AC;&#xC2A4;-api-&#xC11C;&#xBC84;&#xB97C;-aws-lambda&#xB97C;-&#xC774;&#xC6A9;&#xD558;&#xC5EC;-&#xC11C;&#xBC84;&#xB9AC;&#xC2A4;&#xB85C;-&#xBCC0;&#xACBD;&#xD558;&#xAE30;">&#xAE30;&#xC874; &#xBAA8;&#xB178;&#xB9AC;&#xC2A4; API &#xC11C;&#xBC84;&#xB97C; AWS Lambda&#xB97C; &#xC774;&#xC6A9;&#xD558;&#xC5EC; &#xC11C;&#xBC84;&#xB9AC;&#xC2A4;&#xB85C; &#xBCC0;&#xACBD;&#xD558;&#xAE30;</h2>
<p><a href="https://github.com/DevStarSJ/Study/blob/master/Blog/Cloud/AWS/Serverless/MonolithToServerless.01.md" target="_blank" rel="external">&#xC774;&#xC804;&#xAE00; : 1&#xD3B8;. &#xC11C;&#xBC84;&#xB9AC;&#xC2A4;&#xB97C; &#xD558;&#xB824;&#xB294; &#xC774;&#xC720;</a><br>
<a href="https://github.com/DevStarSJ/Study/blob/master/Blog/Cloud/AWS/Serverless/MonolithToServerless.02.md" target="_blank" rel="external">&#xC774;&#xC804;&#xAE00; : 2&#xD3B8;. &#xC7A5;&#xC560; &#xB300;&#xC751; &#xD50C;&#xB79C;</a></p>
<h3 id="&#xD3B8;.-lambda-&#xBC30;&#xD3EC;-&#xD6C4;-&#xACAA;&#xAC8C;&#xB418;&#xB294;-&#xC77C;&#xB4E4;">3&#xD3B8;. Lambda &#xBC30;&#xD3EC; &#xD6C4; &#xACAA;&#xAC8C;&#xB418;&#xB294; &#xC77C;&#xB4E4;</h3>
<p>&#xC11C;&#xBC84;&#xB9AC;&#xC2A4;&#xB97C; &#xAC00;&#xB2A5;&#xD558;&#xAC8C; &#xD574;&#xC8FC;&#xB294; &#xC11C;&#xBE44;&#xC2A4; &#xC911; &#xAC00;&#xC7A5; &#xB9CE;&#xC774; &#xC54C;&#xB824;&#xC9C4;&#xAC8C; AWS <a href="https://aws.amazon.com/lambda" target="_blank" rel="external">Lambda</a>&#xC774;&#xB2E4;. &#xAC04;&#xB2E8;&#xD558;&#xAC8C; &#xC124;&#xBA85;&#xD558;&#xC790;&#xBA74; &#xC11C;&#xBC84;&#xB97C; &#xC2E4;&#xD589;&#xD574; &#xB193;&#xB294;&#xAC8C; &#xC544;&#xB2C8;&#xB77C; &#xC2E4;&#xD589;&#xB420; &#xCF54;&#xB4DC;&#xB97C; &#xC62C;&#xB824;&#xB193;&#xACE0; &#xD574;&#xB2F9; &#xCF54;&#xB4DC;&#xB97C; &#xC2E4;&#xD589;&#xC2DC;&#xD0AC; &#xC774;&#xBCA4;&#xD2B8;&#xB97C; &#xBC1C;&#xC0DD;&#xC2DC;&#xD0A4;&#xBA74; &#xCF54;&#xB4DC;&#xAC00; &#xB3D9;&#xC791;&#xD558;&#xB294; &#xAC83;&#xC774;&#xB2E4;. &#xCF54;&#xB4DC;&#xAC00; &#xC5B4;&#xB290; PC&#xC5D0;&#xC11C; &#xB3D9;&#xC791;&#xD558;&#xB294;&#xC9C0;&#xC5D0; &#xB300;&#xD574;&#xC11C;&#xB294; &#xC6B0;&#xB9AC;&#xAC00; &#xC2E0;&#xACBD;&#xC4F8; &#xD544;&#xC694;&#xC5C6;&#xC774; AWS&#xC5D0; &#xC804;&#xC801;&#xC73C;&#xB85C; &#xB9E1;&#xACA8;&#xB193;&#xB294;&#xB2E4;. &#xACFC;&#xAE08;&#xC740; Lambda &#xC2E4;&#xD589;&#xC2DC;&#xAC04;(100ms &#xB2E8;&#xC704;)&#xC73C;&#xB85C; &#xD55C;&#xB2E4;. 1&#xD3B8; &#xAE00;&#xC5D0;&#xC11C; &#xC598;&#xAE30;&#xD588;&#xB4EF;, EC2 &#xC11C;&#xBC84;&#xB85C; &#xC6B4;&#xC601;&#xD560;&#xB54C;&#xB294; &#xAC11;&#xC790;&#xAE30; &#xC694;&#xCCAD;&#xC774; &#xBAB0;&#xB9AC;&#xB294; &#xACBD;&#xC6B0; &#xC11C;&#xBC84;&#xC5D0; &#xC7A5;&#xC560;&#xAC00; &#xBC1C;&#xC0DD;&#xD560; &#xC218; &#xC788;&#xB294;&#xB370; Lambda&#xC758; &#xACBD;&#xC6B0;&#xB294; &#xADF8;&#xB7F0; &#xC0C1;&#xD669;&#xC790;&#xCCB4;&#xB97C; &#xC804;&#xBD80; AWS&#xC5D0;&#xC11C; &#xC54C;&#xC544;&#xC11C; &#xD574;&#xB2EC;&#xB77C;&#xACE0; &#xC704;&#xC784;&#xD558;&#xB294;&#xAC8C; &#xB41C;&#xB2E4;. &#xC774;&#xB807;&#xAC8C; &#xC0DD;&#xAC01;&#xD558;&#xB294;&#xAC8C; &#xBCF4;&#xB2E4;&#xB294; AWS&#xC5D0;&#xC11C; &#xB9CE;&#xC740; &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xACF5;&#xD1B5;&#xC73C;&#xB85C; &#xC0AC;&#xC6A9;&#xD560; &#xAD49;&#xC7A5;&#xD788; &#xD070; &#xC11C;&#xBC84;&#xB97C; &#xB744;&#xC6CC;&#xB193;&#xACE0; &#xC6B0;&#xB9AC;&#xB294; &#xAC70;&#xAE30;&#xC5D0;&#xC11C; &#xC6B0;&#xB9AC; &#xCF54;&#xB4DC;&#xAC00; &#xC2E4;&#xC81C;&#xB85C; &#xC2E4;&#xD589;&#xB418;&#xB294; &#xC2DC;&#xAC04;&#xB9CC;&#xD07C;&#xB9CC; &#xACFC;&#xAE08;&#xC744; &#xD55C;&#xB2E4;&#xB77C;&#xACE0; &#xC0DD;&#xAC01;&#xD558;&#xB294;&#xAC8C; &#xB354; &#xC26C;&#xC6B4;&#xAC00; ?</p>
<p>Lambda&#xB97C; &#xC218;&#xD589;&#xD558;&#xAE30; &#xC704;&#xD574;&#xC11C;&#xB294; <code>aws-sdk</code>&#xB97C; &#xC774;&#xC6A9;&#xD574;&#xC11C; &#xD638;&#xCD9C;&#xC744; &#xD558;&#xAC70;&#xB098;, AWS &#xB0B4;&#xC758; &#xAC01;&#xC885; &#xC11C;&#xBE44;&#xC2A4;&#xB4E4; CloudWatch, SQS, SNS, Kinesis, DynamoDB &#xB4F1;&#xC5D0;&#xC11C; &#xD2B8;&#xB9AC;&#xAC70;&#xB97C; &#xD1B5;&#xD574;&#xC11C; &#xC2E4;&#xD589;&#xB418;&#xAC8C; &#xD560; &#xC218; &#xC788;&#xB2E4;. Lambda&#xB97C; API&#xB85C; &#xC0AC;&#xC6A9;&#xD558;&#xAE30; &#xC704;&#xD574;&#xC11C;&#xB294; API Gateway&#xB97C; &#xD1B5;&#xD574;&#xC11C; url &#xD615;&#xC2DD;&#xC73C;&#xB85C; &#xC678;&#xBD80; &#xC694;&#xCCAD;&#xC744; &#xBC1B;&#xC544;&#xC11C; Lambda &#xC2E4;&#xD589;&#xC774; &#xAC00;&#xB2A5;&#xD558;&#xB2E4;. &#xC11C;&#xBC84;&#xB9AC;&#xC2A4;&#xB97C; &#xAD6C;&#xD604;&#xD558;&#xAE30; &#xC704;&#xD574;&#xC11C;&#xB294; &#xC8FC;&#xB85C; &#xC774; &#xBC29;&#xBC95;&#xC744; &#xC0AC;&#xC6A9;&#xD55C;&#xB2E4;.</p>
<h2 id="api-&#xC694;&#xCCAD;-&#xC815;&#xBCF4;-&#xBD84;&#xC11D;">API &#xC694;&#xCCAD; &#xC815;&#xBCF4; &#xBD84;&#xC11D;</h2>
<p>&#xAE30;&#xC874;&#xC758; EC2&#xB85C; &#xC218;&#xD589;&#xD558;&#xB358; API &#xC11C;&#xBC84;&#xB97C; CloudFront&#xB97C; &#xD1B5;&#xD574;&#xC11C; &#xC218;&#xD589;&#xB418;&#xB3C4;&#xB85D; &#xC124;&#xC815;&#xD558;&#xC600;&#xB2E4;. CloudFront&#xC5D0;&#xC11C;&#xB294; &#xC694;&#xCCAD;&#xB4E4;&#xC5D0; &#xB300;&#xD574;&#xC11C; S3&#xB85C; &#xB85C;&#xADF8;&#xB97C; &#xC0DD;&#xC131;&#xD574;&#xC8FC;&#xB294; &#xAE30;&#xB2A5;&#xC744; &#xC81C;&#xACF5;&#xD55C;&#xB2E4;. 2&#xD3B8;&#xC5D0;&#xC11C; &#xC124;&#xBA85;&#xD55C; &#xC7A5;&#xC560; &#xB300;&#xC751; &#xD50C;&#xB79C;&#xC744; &#xC218;&#xD589;&#xD558;&#xB294; &#xB3D9;&#xC548; &#xB85C;&#xADF8;&#xB97C; &#xACC4;&#xC18D; &#xC313;&#xC544;&#xB450;&#xC5B4;&#xC11C; &#xC774;&#xAC78; &#xBD84;&#xC11D;&#xD558;&#xC5EC; Lambda&#xB85C; &#xC62E;&#xAE38; API&#xC758; &#xC21C;&#xC11C;&#xB97C; &#xC815;&#xD588;&#xB2E4;.</p>
<p>&#xC804;&#xCCB4;&#xC801;&#xC73C;&#xB85C; &#xC62E;&#xAE38; API&#xC218;&#xB294; 100&#xAC1C;&#xAC00; &#xC0B4;&#xC9DD; &#xB118;&#xB294; &#xC218;&#xC600;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; &#xB85C;&#xADF8;&#xB97C; &#xBCF4;&#xB2C8; &#xC774;&#xC804;&#xCCB4;&#xAC00; &#xC9C0;&#xAE08; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xAC83;&#xC740; &#xC544;&#xB2C8;&#xC5C8;&#xB2E4;. 3&#xC8FC; &#xB3D9;&#xC548; &#xD638;&#xCD9C;&#xB41C; API&#xC758; &#xC218;&#xB294; 50 &#xC815;&#xB3C4;&#xAC00; &#xB418;&#xC5C8;&#xC73C;&#xBA70;, &#xC774; &#xC911; &#xB9CE;&#xC774; &#xD638;&#xCD9C;&#xB418;&#xACE0; &#xB0B4;&#xBD80; &#xCF54;&#xB4DC;&#xAC00; &#xBE44;&#xAD50;&#xC801; &#xAC04;&#xB2E8;&#xD55C; &#xAC83;&#xBD80;&#xD130; &#xC791;&#xC5C5;&#xC744; &#xC2DC;&#xC791;&#xD588;&#xB2E4;.</p>
<p>S3&#xC5D0; &#xC313;&#xC544;&#xB454; &#xB85C;&#xADF8;&#xB294; python&#xC758; boto3&#xB97C; &#xC774;&#xC6A9;&#xD574;&#xC11C; &#xADF8;&#xB0E5; &#xB178;&#xD2B8;&#xBD81;&#xC73C;&#xB85C; &#xB2E4;&#xC6B4;&#xBC1B;&#xC544;&#xC11C; gz &#xC555;&#xCD95;&#xC744; &#xD480;&#xACE0; &#xB0B4;&#xAC00; &#xD544;&#xC694;&#xD55C; &#xC815;&#xBCF4;&#xB9CC; &#xB530;&#xB85C; &#xCD94;&#xB824;&#xC11C; csv&#xB85C; &#xB9CC;&#xB4E4;&#xC5B4;&#xC11C; &#xAC01; url path &#xBCC4;&#xB85C; &#xD638;&#xCD9C; &#xBE48;&#xB3C4;&#xB97C; &#xCE74;&#xC6B4;&#xD305;&#xD558;&#xC600;&#xB2E4;. &#xADF8;&#xB7F0;&#xB370; path&#xB97C; &#xC778;&#xC790;&#xB85C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xACBD;&#xC6B0;&#xB294; &#xC804;&#xBD80; &#xB2E4;&#xB978; path url&#xB85C; &#xC778;&#xC2DD;&#xB418;&#xC5B4;&#xC11C; &#xAC04;&#xB2E8;&#xD558;&#xAC8C; &#xADF8;&#xB7F0; &#xACBD;&#xC6B0;&#xB9CC; &#xB530;&#xB85C; path pattern&#xC744; &#xB9CC;&#xB4E4;&#xC5B4;&#xC11C; csv &#xD30C;&#xC77C;&#xC744; &#xB9CC;&#xB4E4;&#xB3C4;&#xB85D; &#xC218;&#xC815;&#xD588;&#xB2E4;.</p>
<p>S3&#xC5D0; &#xC313;&#xC544;&#xB454; &#xB85C;&#xADF8;&#xB97C; &#xBCF4;&#xB2C8; querystring &#xC815;&#xBCF4;&#xB294; &#xBCFC; &#xC218; &#xC788;&#xC5C8;&#xC9C0;&#xB9CC;, POST &#xC694;&#xCCAD;&#xC5D0; &#xB300;&#xD55C; body &#xC815;&#xBCF4;&#xB294; &#xC5C6;&#xC5C8;&#xB2E4;. headers&#xC758; &#xC815;&#xBCF4;&#xAC00; &#xC804;&#xBD80; &#xB2E4; &#xC788;&#xB294;&#xAC74; &#xC544;&#xB2C8;&#xC5C8;&#xC9C0;&#xB9CC; &#xC911;&#xC694;&#xD55C; &#xBA87;&#xAC00;&#xC9C0;&#xB294; &#xC81C;&#xACF5;&#xD574;&#xC8FC;&#xACE0; &#xC788;&#xC5C8;&#xB2E4;.</p>
<p>&#xCCAB;&#xBC88;&#xC9F8;&#xB85C; &#xC62E;&#xAE38; API&#xB294; &#xB124;&#xBC88;&#xC9F8;&#xB85C; &#xC790;&#xC8FC; &#xC694;&#xCCAD;&#xB418;&#xB294; &#xC0AC;&#xC6A9;&#xC790; &#xC815;&#xBCF4;&#xB97C; JSON &#xD615;&#xC2DD;&#xC73C;&#xB85C; &#xBCF4;&#xB0B4;&#xC8FC;&#xB294; API(/user/{id})&#xB85C; &#xC815;&#xD588;&#xB2E4;. Lambda &#xBA85;&#xCE6D;&#xB3C4; &#xADF8;&#xB0E5; <code>api-user-id</code>&#xB85C; &#xC9C0;&#xC5C8;&#xB2E4;.</p>
<h2 id="&#xCCAB;&#xBC88;&#xC9F8;-&#xB9AC;&#xBBF8;&#xD2B8;-lambda-&#xB9AC;&#xBBF8;&#xD2B8;">&#xCCAB;&#xBC88;&#xC9F8; &#xB9AC;&#xBBF8;&#xD2B8; : Lambda &#xB9AC;&#xBBF8;&#xD2B8;</h2>
<p>AWS Lambda &#xB9AC;&#xBBF8;&#xD2B8;&#xC758; &#xAE30;&#xBCF8;&#xAC12;&#xC740; &#xAC01; &#xB9AC;&#xC83C; &#xB2F9; <strong>100</strong>&#xBC88;&#xC774;&#xB2E4;. &#xB3D9;&#xC2DC;&#xC5D0; &#xC218;&#xD589;&#xAC00;&#xB2A5;&#xD55C; Lambda&#xC758; &#xC218;&#xB97C; &#xB73B;&#xD55C;&#xB2E4;. &#xB300;&#xB7B5;&#xC801;&#xC73C;&#xB85C; &#xC218;&#xD589;&#xC2DC;&#xAC04;&#xC774; 100ms&#xC778; Lambda&#xC778; &#xACBD;&#xC6B0; &#xCD08;&#xB2F9; 1&#xCC9C;&#xBC88;&#xAE4C;&#xC9C0; &#xD638;&#xCD9C;&#xD574;&#xB3C4; &#xAD1C;&#xCC2E;&#xB2E4;. &#xBB3C;&#xB85C; &#xC774; &#xC218;&#xCE58;&#xB294; &#xD3C9;&#xADE0;&#xC801;&#xC778; &#xAC83;&#xC774;&#xC9C0; &#xC774;&#xB7F0; &#xC694;&#xCCAD;&#xC774; &#xC21C;&#xAC04;&#xC801;&#xC73C;&#xB85C; 100&#xBC88; &#xC774;&#xC0C1; &#xD638;&#xCD9C;&#xB418;&#xBA74; &#xC2E4;&#xD328;&#xAC00; &#xBC1C;&#xC0DD;&#xD55C;&#xB2E4;. Lambda &#xB9AC;&#xBBF8;&#xD2B8;&#xAC00; &#xBC1C;&#xC0DD;&#xD55C; &#xAC83;&#xC740; Lambda&#xCABD; CloudWatch &#xB85C;&#xADF8;&#xC5D0;&#xC11C;&#xB294; &#xD655;&#xC778;&#xC774; &#xB418;&#xC9C0; &#xC54A;&#xB294;&#xB2E4;. &#xC65C;&#xB0D0;&#xBA74; &#xC218;&#xD589; &#xC790;&#xCCB4;&#xAC00; &#xC548;&#xB418;&#xC5C8;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; Lambda&#xC5D0; &#xB85C;&#xADF8;&#xAC00; &#xBC1C;&#xC0DD;&#xD558;&#xC9C0; &#xC54A;&#xB294;&#xB2E4;. &#xD574;&#xB2F9; Lambda&#xB85C; &#xC5F0;&#xACB0;&#xB41C; API Gateway&#xC758; &#xC624;&#xB958;&#xB97C; CloudWatch&#xB85C; &#xB85C;&#xADF8;&#xB97C; &#xB0A8;&#xAE30;&#xB3C4;&#xB85D; &#xC124;&#xC815;&#xD558;&#xBA74; &#xD655;&#xC778;&#xC774; &#xAC00;&#xB2A5;&#xD558;&#xB2E4;. &#xC815;&#xD655;&#xC778; &#xC624;&#xB958; &#xBA54;&#xC138;&#xC9C0;&#xB294; &#xAE30;&#xC5B5;&#xC774; &#xB098;&#xC9C0; &#xC54A;&#xC9C0;&#xB9CC; <code>exceed</code>&#xB85C; &#xAC80;&#xC0C9;&#xC744; &#xD55C;&#xAC83; &#xAC19;&#xB2E4;.</p>
<p>&#xD604;&#xC7AC; &#xD68C;&#xC0AC; &#xACC4;&#xC815;&#xC5D0;&#xC11C;&#xB294; &#xB3C4;&#xCFC4; &#xB9AC;&#xC83C;&#xC5D0; Lambda &#xB9AC;&#xBBF8;&#xD2B8;&#xB97C; <strong>200</strong>&#xAC1C;&#xB85C; &#xB298;&#xB824;&#xB193;&#xC740; &#xC0C1;&#xD0DC;&#xC600;&#xB2E4;.</p>
<p><code>api-user-id</code>&#xB97C; &#xBC30;&#xD3EC;&#xD55C; &#xD6C4; &#xC5BC;&#xB9C8; &#xC9C0;&#xB098;&#xC9C0; &#xC54A;&#xC544;&#xC11C; 5XX &#xC624;&#xB958;&#xAC00; &#xBD84;&#xB2F9; 150&#xBC88; &#xC815;&#xB3C4; &#xACC4;&#xC18D; &#xBC1C;&#xC0DD;&#xD558;&#xC600;&#xB2E4;. &#xC77C;&#xB2E8; API&#xB97C; &#xC6D0;&#xB798;&#xB300;&#xB85C; &#xB864;&#xBC31;&#xD55C; &#xD6C4; &#xB85C;&#xADF8;&#xB97C; &#xBCF4;&#xB2C8; Lambda &#xB9AC;&#xBBF8;&#xD2B8;&#xC5D0; &#xAC78;&#xB838;&#xB2E4;. &#xCC98;&#xC74C;&#xBD80;&#xD130; &#xB108;&#xBB34; &#xC694;&#xCCAD;&#xC774; &#xB9CE;&#xC740; API&#xB97C; &#xC62E;&#xAE34;&#xAC83; &#xAC19;&#xB2E4;. AWS&#xC5D0; &#xC694;&#xCCAD;&#xC744; &#xD588;&#xB2E4;. EC2&#xB85C; &#xB418;&#xC5B4;&#xC788;&#xB294; &#xC11C;&#xBC84;&#xB97C; Lambda&#xB85C; &#xC62E;&#xAE30;&#xACE0; &#xC788;&#xB2E4;. 100&#xAC1C;&#xAC00; &#xB118;&#xB294;&#xAC78; &#xBAA8;&#xB450; &#xC62E;&#xAE38;&#xB824;&#xACE0; &#xD558;&#xB294;&#xB370; &#xADF8; &#xC911; 1&#xAC1C;&#xB9CC; &#xC62E;&#xACBC;&#xB294;&#xB370;&#xB3C4; Lambda &#xB9AC;&#xBBF8;&#xD2B8;&#xAC00; &#xBC1C;&#xC0DD;&#xD588;&#xB2E4;. 1 ~ 2k &#xC815;&#xB3C4;&#xB85C; &#xC880; &#xC62C;&#xB824;&#xB2EC;&#xB77C;&#xACE0; &#xC694;&#xCCAD;&#xC744; &#xD588;&#xB354;&#xB2C8; &#xC774;&#xD2C0; &#xB4A4; &#xC544;&#xCE68;&#xC5D0; &#xCD9C;&#xADFC;&#xD574;&#xC11C; &#xD655;&#xC778;&#xD558;&#xB2C8; <strong>2000</strong>&#xAC1C;&#xB85C; &#xB9AC;&#xBBF8;&#xD2B8;&#xB97C; &#xC62C;&#xB838;&#xB2E4;&#xB294; &#xB0B4;&#xC6A9;&#xC744; &#xD655;&#xC778; &#xD560; &#xC218; &#xC788;&#xC5C8;&#xB2E4;.</p>
<h2 id="&#xB450;&#xBC88;&#xC9F8;-&#xB9AC;&#xBBF8;&#xD2B8;-subnet-limit">&#xB450;&#xBC88;&#xC9F8; &#xB9AC;&#xBBF8;&#xD2B8; : Subnet Limit</h2>
<p>Lambda &#xB9AC;&#xBBF8;&#xD2B8;&#xAC00; 2000&#xAC1C;&#xB85C; &#xC99D;&#xAC00;&#xB418;&#xC5C8;&#xB2E4;&#xB294; &#xC18C;&#xC2DD;&#xC744; &#xB4E3;&#xACE0; API&#xB97C; &#xB2E4;&#xC2DC; &#xBC30;&#xD3EC;&#xD558;&#xC600;&#xB2E4;. &#xC544;&#xCE68; &#xC77C;&#xCC0D; &#xBC30;&#xD3EC;&#xD588;&#xB294;&#xB370; &#xC815;&#xC0C1;&#xC801;&#xC73C;&#xB85C; &#xC798; &#xB3D9;&#xC791;&#xD558;&#xACE0; &#xC788;&#xC5C8;&#xB2E4;. &#xC624;&#xD6C4; 4&#xC2DC;&#xC5D0; &#xC571; &#xD478;&#xC2DC;&#xAC00; &#xB098;&#xAC04; &#xB4A4; Lambda &#xC218;&#xD589;&#xC774; &#xBD84;&#xB2F9; 1&#xB9CC;&#xBC88;&#xC744; &#xB118;&#xAE30;&#xBA74;&#xC11C; 5XX &#xC624;&#xB958;&#xAC00; &#xC9C0;&#xC18D;&#xC801;&#xC73C;&#xB85C; &#xBC1C;&#xC0DD;&#xD588;&#xB2E4;.</p>
<p>&#xB2E4;&#xC2DC; API&#xB97C; &#xB864;&#xBC31;&#xD558;&#xACE0; API Gateway&#xCABD; &#xC624;&#xB958;&#xB97C; &#xC0B4;&#xD3B4;&#xBCF4;&#xB2C8; &#xCC98;&#xC74C;&#xBCF4;&#xB294; &#xBA54;&#xC138;&#xC9C0; &#xC600;&#xB2E4;.</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div><div class="line">7</div><div class="line">8</div><div class="line">9</div></pre></td><td class="code"><pre><div class="line">Endpoint response body before transformations:</div><div class="line">{</div><div class="line">    &quot;Message&quot;: &quot;Lambda was not able to create an ENI in the VPC of the Lambda function because the limit for Network Interfaces has been reached.&quot;,</div><div class="line">    &quot;Type&quot;: &quot;User&quot;</div><div class="line">}</div><div class="line"></div><div class="line">Execution failed due to configuration error: Malformed Lambda proxy response</div><div class="line"></div><div class="line">Method completed with status: 502</div></pre></td></tr></table></figure>
<p>VPC&#xC5D0;&#xC11C; ENI&#xB97C; &#xB9CC;&#xB4E4;&#xC9C0; &#xBABB;&#xD588;&#xB2E8;&#xB2E4;. Lambda&#xB97C; VPC&#xC5D0;&#xC11C; &#xC218;&#xD589;&#xB418;&#xB3C4;&#xB85D; &#xC124;&#xC815;&#xD560; &#xD544;&#xC694;&#xB294; &#xC5C6;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; &#xBCF4;&#xC548;&#xC744; &#xC704;&#xD574;&#xC11C; &#xADF8;&#xB807;&#xAC8C; &#xC124;&#xC815;&#xD574; &#xB193;&#xB294; &#xACBD;&#xC6B0;&#xAC00; &#xB9CE;&#xB2E4;. MySQL&#xC758; &#xACBD;&#xC6B0; &#xC0AC;&#xC6A9;&#xC790; ID, &#xBE44;&#xBC00;&#xBC88;&#xD638;&#xB85C;&#xB9CC; &#xBCF4;&#xC548;&#xC744; &#xC124;&#xC815;&#xD574; &#xB193;&#xB294;&#xAC83; &#xBCF4;&#xB2E4;&#xB294; &#xD2B9;&#xC815; &#xB300;&#xC5ED;&#xB300;&#xC758; IP&#xB4E4;&#xB9CC; &#xC811;&#xC18D;&#xC744; &#xD5C8;&#xC6A9;&#xD574; &#xB193;&#xB294;&#xAC8C; &#xB354; &#xC548;&#xC804;&#xD558;&#xB2E4;. Lambda &#xAC19;&#xC740; &#xACBD;&#xC6B0;&#xB294; &#xC5B4;&#xB5A4; IP&#xB85C; &#xC0DD;&#xC131;&#xB418;&#xB294;&#xC9C0; &#xC6B0;&#xB9AC;&#xAC00; &#xC54C; &#xC218;&#xAC00; &#xC5C6;&#xC73C;&#xBBC0;&#xB85C; VPC &#xC124;&#xC815;&#xC744; &#xD1B5;&#xD574;&#xC11C; &#xD2B9;&#xC815; &#xB300;&#xC5ED;&#xB300;&#xC758; subnet &#xC548;&#xC5D0;&#xC11C; &#xC0DD;&#xC131;&#xB418;&#xB3C4;&#xB85D; &#xC124;&#xC815;&#xC774; &#xAC00;&#xB2A5;&#xD558;&#xB2E4;. <strong>AWS VPC</strong> &#xC11C;&#xBE44;&#xC2A4;&#xB97C; &#xC774;&#xC6A9;&#xD558;&#xC5EC; &#xC0DD;&#xC131;&#xB41C; VPC&#xC640; subnet&#xC744; &#xC124;&#xC815;&#xD574; &#xB450;&#xC5C8;&#xB2E4;. subnet&#xC740; 4000&#xAC1C;&#xC9DC;&#xB9AC; 2&#xAC1C;&#xB97C; &#xC124;&#xC815;&#xD588;&#xB2E4;. &#xD569;&#xC774; 8000&#xAC1C;&#xC778;&#xB370;, &#xB3D9;&#xC2DC; &#xC218;&#xD589;&#xC218;&#xAC00; 2000&#xAC1C;&#xC9DC;&#xB9AC; Lambda&#xAC00; &#xB9AC;&#xBBF8;&#xD2B8;&#xC5D0; &#xAC78;&#xB824;&#xC11C; &#xC0DD;&#xC131;&#xB418;&#xC9C0; &#xC54A;&#xC558;&#xB2E4;&#xB2C8;&#x2026;</p>
<p>&#xADF8;&#xB798;&#xC11C; 16000&#xAC1C;&#xC9DC;&#xB9AC; subnet&#xC744; &#xD558;&#xB098; &#xB354; &#xC0DD;&#xC131;&#xD558;&#xC600;&#xB2E4;. &#xAE30;&#xC874;&#xC5D0; &#xC218;&#xD589;&#xC911;&#xC774;&#xB358; Lambda&#xB3C4; &#xB9CE;&#xC774; &#xC788;&#xC5C8;&#xC73C;&#xBBC0;&#xB85C;, &#xC774;&#xBC88;&#xC5D0; &#xC0C8;&#xB85C; &#xB9CC;&#xB4E0; api-user-id&#xC5D0;&#xB294; &#xAE30;&#xC874;&#xC758; 4000&#xAC1C; subnet &#xD558;&#xB098;&#xC640; &#xC0C8;&#xB85C;&#xB9CC;&#xB4E0; 16000&#xAC1C; &#xD558;&#xB098;&#xB97C; &#xC124;&#xC815;&#xD574; &#xB450;&#xC5C8;&#xB2E4;. &#xD569;&#xC774; 2&#xB9CC;&#xAC1C;&#xC778;&#xB370; &#xB2F9;&#xC5F0;&#xD788; &#xBD80;&#xC871;&#xD558;&#xC9C0; &#xC54A;&#xC73C;&#xB9AC;&#xB77C; &#xD310;&#xB2E8;&#xD588;&#xB2E4;.</p>
<h2 id="&#xC138;&#xBC88;&#xC9F8;-&#xB9AC;&#xBBF8;&#xD2B8;-network-interface-&#xB9AC;&#xBBF8;&#xD2B8;">&#xC138;&#xBC88;&#xC9F8; &#xB9AC;&#xBBF8;&#xD2B8; : Network Interface &#xB9AC;&#xBBF8;&#xD2B8;</h2>
<p>&#xC0AC;&#xC2E4;&#xC0C1; &#xB450;&#xBC88;&#xC9F8; &#xB9AC;&#xBBF8;&#xD2B8;&#xB294; VPC &#xB9AC;&#xBBF8;&#xD2B8;&#xAC00; &#xC544;&#xB2C8;&#xB77C; Network Interface &#xB9AC;&#xBBF8;&#xD2B8; &#xC600;&#xB2E4;.</p>
<p>&#xC774;&#xD2C0; &#xB4A4;&#xC5D0; &#xD574;&#xB2F9; API&#xB97C; &#xB2E4;&#xC2DC; &#xBC30;&#xD3EC;&#xD588;&#xB2E4;. &#xADF8;&#xB7F0;&#xB370; &#xBE44;&#xC2B7;&#xD55C; &#xC2DC;&#xAE30;&#xC5D0; &#xBE44;&#xC2B7;&#xD55C; &#xBE48;&#xB3C4;&#xB85C; 5XX &#xC624;&#xB958;&#xAC00; &#xBC1C;&#xC0DD;&#xD558;&#xC600;&#xB2E4;. &#xBD84;&#xBA85; subnet&#xC758; &#xC218;&#xAC00; 2&#xBC30; &#xC774;&#xC0C1;&#xC73C;&#xB85C; &#xB298;&#xB838;&#xB294;&#xB370;&#xB3C4; &#xACC4;&#xC18D; &#xC624;&#xB958;&#xAC00; &#xBC1C;&#xC0DD;&#xD558;&#xC600;&#xB2E4;. &#xC65C; &#xADF8;&#xB7F4;&#xAE4C; &#xC0DD;&#xAC01;&#xC744; &#xD574;&#xBD24;&#xB294;&#xB370;, subnet 2&#xAC1C; (4000&#xAC1C;, 16000&#xAC1C;)&#xB97C; &#xD569;&#xCCD0;&#xC11C; 2&#xB9CC;&#xAC1C; &#xC911;&#xC5D0; 1&#xAC1C;&#xB85C; &#xD560;&#xB2F9;&#xD558;&#xB294;&#xAC8C; &#xC544;&#xB2C8;&#xB77C; 2&#xAC1C;&#xC758; subnet &#xC911; &#xD558;&#xB098;&#xB97C; &#xC120;&#xD0DD;&#xD574;&#xC11C; &#xAC70;&#xAE30;&#xC5D0; &#xD560;&#xB2F9;&#xC744; &#xD558;&#xB294; &#xC2DD;&#xC744; &#xB3D9;&#xC791;&#xD558;&#xB294;&#xAC8C; &#xC544;&#xB2CC;&#xAC00;&#xB77C; &#xD310;&#xB2E8;&#xB41C;&#xB2E4;. &#xADF8;&#xB798;&#xC11C; &#xBC14;&#xB85C; 4000&#xAC1C;&#xC758; subnet&#xC744; &#xC124;&#xC815;&#xC5D0;&#xC11C; &#xC0AD;&#xC81C;&#xD558;&#xC600;&#xB2E4;. &#xC0AD;&#xC81C;&#xD558;&#xC790;&#xB9C8;&#xC790; &#xC694;&#xCCAD; &#xB300;&#xBE44; &#xC624;&#xB958;&#xAC00; 50% &#xAC00;&#xAE4C;&#xC774;&#xB85C; &#xBC1C;&#xC0DD;&#xD588;&#xB2E4;. &#xB2E4;&#xC2DC; &#xD574;&#xB2F9; API&#xB97C; &#xB864;&#xBC31;&#xD588;&#xB2E4;. &#xADF8; &#xB4A4;&#xC5D0; &#xC0DD;&#xAC01;&#xD574;&#xBCF4;&#xB2C8; &#xC694;&#xCCAD;&#xC744; &#xC0AD;&#xC81C;&#xD55C; subnet&#xCABD; &#xC8FC;&#xC18C;&#xB85C; &#xACC4;&#xC18D;&#xD574;&#xC11C; &#xBCF4;&#xB0C8;&#xB358; &#xAC83;&#xC73C;&#xB85C; &#xCD94;&#xC815;&#xB41C;&#xB2E4;. 2&#xAC1C; &#xC911; 1&#xAC1C;&#xB97C; &#xC0AD;&#xC81C;&#xD588;&#xC73C;&#xB2C8; 50% &#xC815;&#xB3C4;&#xC758; &#xC624;&#xB958;&#xAC00; &#xBC1C;&#xC0DD;&#xD55C;&#xAC8C; &#xC544;&#xB2CC;&#xAC00; &#xC0DD;&#xAC01;&#xB41C;&#xB2E4;.</p>
<p>&#xADF8;&#xB7F0;&#xB370; &#xBB38;&#xC81C;&#xB294; subnet&#xC758; &#xAC2F;&#xC218;&#xAC00; &#xBD80;&#xC871;&#xD574;&#xC11C;&#xAC00; &#xC544;&#xB2C8;&#xB77C; &#xB2E4;&#xB978; &#xACF3;&#xC774;&#xC5C8;&#xB2E4;. AWS&#xC5D0; &#xBB38;&#xC758;&#xB97C; &#xD558;&#xB2C8; <a href="http://docs.aws.amazon.com/AmazonVPC/latest/UserGuide/VPC_Appendix_Limits.html#vpc-limits-enis" class="uri" target="_blank" rel="external">http://docs.aws.amazon.com/AmazonVPC/latest/UserGuide/VPC_Appendix_Limits.html#vpc-limits-enis</a> &#xB9C1;&#xD06C;&#xB97C; &#xBCF4;&#xB0B4;&#xC8FC;&#xC5C8;&#xB2E4;. &#xB9AC;&#xC804;&#xB2F9; Network Interface&#xAC00; &#xCD5C;&#xB300; 350&#xAC1C;&#xB77C;&#xACE0; &#xC124;&#xBA85;&#xC774; &#xB418;&#xC5B4; &#xC788;&#xB2E4;. &#xB354; &#xB298;&#xB9AC;&#xACE0; &#xC2F6;&#xC73C;&#xBA74; &#xBB38;&#xC758;&#xB97C; &#xD558;&#xB77C;&#xACE0; &#xB418;&#xC5B4;&#xC788;&#xB2E4;. &#xD68C;&#xC0AC; &#xB3D9;&#xB8CC;&#xBD84;&#xC774; &#xC800; &#xC815;&#xBCF4;&#xB97C; &#xC5B4;&#xB514;&#xC11C; &#xD655;&#xC778; &#xAC00;&#xB2A5;&#xD55C;&#xC9C0; &#xCC3E;&#xC544;&#xC8FC;&#xC5C8;&#xB2E4;.</p>
<p>EC2&#xB85C; &#xB4E4;&#xC5B4;&#xAC00;&#xC11C; &#xC67C;&#xCABD;&#xC5D0; &#xBCF4;&#xBA74; Network Interface&#xB77C;&#xB294; &#xD0ED;&#xC774; &#xC788;&#xB2E4;. &#xAC70;&#xAE30;&#xC5D0; &#xB4E4;&#xC5B4;&#xAC00;&#xBCF4;&#xB2C8; &#xD604;&#xC7AC; &#xC0AC;&#xC6A9;&#xC911;&#xC778; Network Interface&#xAC00; 341&#xAC1C; &#xC600;&#xACE0;, &#xADF8;&#xC911; Description&#xC774; AWS Lambda &#xB85C; &#xC2DC;&#xC791;&#xD558;&#xB294;&#xAC8C; 240&#xAC1C;&#xAC00; &#xB118;&#xC5C8;&#xB2E4;. &#xB2E4;&#xC2DC; AWS&#xC5D0; &#xBB38;&#xC758;&#xB97C; &#xD558;&#xC5EC; &#xD574;&#xB2F9; &#xB9AC;&#xBBF8;&#xD2B8;&#xB97C; &#xB298;&#xB824;&#xB2EC;&#xB77C;&#xACE0; &#xD558;&#xC600;&#xB354;&#xB2C8; 2000&#xAC1C;&#xB85C; &#xB298;&#xB824;&#xC92C;&#xB2E4;&#xB294; &#xB2F5;&#xBCC0;&#xC774; &#xC654;&#xB2E4;.</p>
<p>&#xC77C;&#xB2E8; subnet&#xC744; 4000&#xAC1C; 6&#xAC1C;&#xB85C; &#xB2E4;&#xC2DC; &#xD560;&#xB2F9;&#xC744; &#xD558;&#xC5EC;&#xC11C; &#xBC30;&#xD3EC;&#xB97C; &#xD588;&#xB294;&#xB370;, &#xADF8; &#xB4A4;&#xB85C;&#xB294; &#xD574;&#xB2F9; &#xC624;&#xB958;&#xAC00; &#xB354; &#xC774;&#xC0C1; &#xBC1C;&#xC0DD;&#xD558;&#xC9C0; &#xC54A;&#xACE0; &#xC815;&#xC0C1;&#xC801;&#xC73C;&#xB85C; &#xB3D9;&#xC791;&#xD558;&#xC600;&#xB2E4;.</p>
<h2 id="&#xB124;&#xBC88;&#xC9F8;-&#xB9AC;&#xBBF8;&#xD2B8;-api-gateway-&#xB9AC;&#xBBF8;&#xD2B8;">&#xB124;&#xBC88;&#xC9F8; &#xB9AC;&#xBBF8;&#xD2B8; : API Gateway &#xB9AC;&#xBBF8;&#xD2B8;</h2>
<p>API Gateway&#xC5D0;&#xB3C4; &#xB9AC;&#xBBF8;&#xD2B8;&#xAC00; &#xC788;&#xB2E4;. &#xAE30;&#xBCF8;&#xC801;&#xC73C;&#xB85C;&#xB294; &#xD3C9;&#xADE0; &#xCD08;&#xB2F9; 1000&#xBC88;, &#xCD5C;&#xB300; 1&#xCD08;&#xB2F9; 2000&#xBC88;&#xC758; &#xC694;&#xCCAD;&#xC744; &#xCC98;&#xB9AC; &#xAC00;&#xB2A5;&#xD558;&#xB3C4;&#xB85D; &#xB418;&#xC5B4;&#xC788;&#xB2E4;.</p>
<p>CloudWatch&#xB97C; &#xD1B5;&#xD574;&#xC11C; &#xC0B4;&#xD3B4;&#xBCF4;&#xB358; &#xC911; &#xD2B9;&#xC815; &#xC2DC;&#xAC04;&#xB300;&#xC5D0; 5XX &#xC624;&#xB958;&#xAC00; &#xBC1C;&#xC0DD;&#xB418;&#xC5C8;&#xAE38;&#xB798; &#xADF8;&#xB54C;&#xB97C; &#xC0B4;&#xD3B4;&#xBCF4;&#xB2C8; 1&#xBD84;&#xC5D0; 2&#xB9CC;&#xBC88; &#xC815;&#xB3C4;&#xC758; &#xC694;&#xCCAD;&#xC774; &#xC788;&#xC5C8;&#xB2E4;. &#xCD08;&#xB2F9; &#xC694;&#xCCAD;&#xC73C;&#xB85C; &#xACC4;&#xC0B0;&#xD558;&#xBA74; API Gateway&#xC758; &#xB9AC;&#xBBF8;&#xD2B8;&#xBCF4;&#xB2E4; &#xC791;&#xC558;&#xC9C0;&#xB9CC;, &#xD639;&#xC2DC; &#xC9E7;&#xC740; &#xC2DC;&#xAC04;&#xC5D0; 2000&#xBC88; &#xC774;&#xC0C1;&#xC758; &#xC694;&#xCCAD;&#xC774; &#xC788;&#xC9C0; &#xC54A;&#xC558;&#xB098; &#xD310;&#xB2E8;&#xB418;&#xC5B4; AWS&#xC5D0; &#xC694;&#xCCAD;&#xD558;&#xC600;&#xC73C;&#xB098;, API Gateway&#xC758; &#xBB38;&#xC81C;&#xB294; &#xC544;&#xB2C8;&#xC5C8;&#xACE0;, Lambda &#xB9AC;&#xBBF8;&#xD2B8;&#xAC00; &#xBC1C;&#xC0DD;&#xD55C; &#xAC83;&#xC73C;&#xB85C; &#xD310;&#xB2E8;&#xB418;&#xC5C8;&#xB2E4;&#xBA74;&#xC11C; Lambda &#xB9AC;&#xBBF8;&#xD2B8;&#xB97C; 3000&#xAC1C;&#xB85C; &#xB298;&#xB824;&#xC8FC;&#xC5C8;&#xB2E4;.</p>
<h2 id="&#xADF8;-&#xC774;&#xD6C4;">&#xADF8; &#xC774;&#xD6C4;&#x2026;</h2>
<p>&#xADF8; &#xB4A4; &#xD574;&#xB2F9; API&#xB294; &#xC798; &#xB3D9;&#xC791;&#xD558;&#xACE0; &#xC788;&#xB2E4;. &#xB2E4;&#xB978; API&#xB4E4;&#xB3C4; &#xC791;&#xC5C5;&#xD574;&#xC11C; &#xBC30;&#xD3EC;&#xB97C; &#xD588;&#xB294;&#xB370; &#xC544;&#xBB34;&#xB7F0; &#xBB38;&#xC81C;&#xAC00; &#xC5C6;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; &#xC55E;&#xC73C;&#xB85C; &#xBA87; &#xAC1C;&#xC758; API&#xB97C; &#xB354; &#xBC30;&#xD3EC;&#xD558;&#xBA74; &#xD604;&#xC7AC;&#xC758; &#xB9AC;&#xBBF8;&#xD2B8;&#xB97C; &#xB2E4;&#xC2DC; &#xB118;&#xAE30;&#xC9C0; &#xC54A;&#xC744;&#xAE4C; &#xAC71;&#xC815;&#xC774; &#xB41C;&#xB2E4;. &#xADF8;&#xAC78; &#xBBF8;&#xB9AC; &#xC608;&#xCE21;&#xD574;&#xC11C; AWS&#xC5D0; &#xC694;&#xCCAD;&#xC744; &#xD558;&#xBA74; &#xACFC;&#xC5F0; &#xB4E4;&#xC5B4;&#xC904;&#xC9C0; &#xBAA8;&#xB974;&#xACA0;&#xB2E4;. &#xADF8;&#xB798;&#xC11C; &#xD56D;&#xC0C1; API&#xB97C; &#xBC30;&#xD3EC;&#xD558;&#xACE0;&#xB294; Lambda &#xC2E4;&#xD589;&#xC218;, Network Interface &#xC218; &#xB4F1;&#xC5D0; &#xB300;&#xD574;&#xC11C; &#xBAA8;&#xB2C8;&#xD130;&#xB9C1;&#xC744; &#xD558;&#xACE0; &#xC788;&#xB2E4;.</p>
<h2 id="&#xAE30;&#xD0C0;-&#xC791;&#xC5C5;&#xD558;&#xBA74;&#xC11C;-&#xACAA;&#xC740;-&#xC77C;&#xB4E4;">&#xAE30;&#xD0C0; &#xC791;&#xC5C5;&#xD558;&#xBA74;&#xC11C; &#xACAA;&#xC740; &#xC77C;&#xB4E4;</h2>
<h3 id="cloudfront">1. CloudFront</h3>
<p>CloudFront&#xC5D0;&#xC11C; &#xCE90;&#xC2DC;&#xC124;&#xC815; &#xD560; &#xB54C; headers&#xC5D0; &#xD1A0;&#xD070; &#xAC19;&#xC740;&#xAC83;&#xC744; &#xC804;&#xB2EC;&#xD558;&#xC5EC; &#xADF8;&#xAC83;&#xC5D0; &#xB300;&#xD574;&#xC11C; &#xB2E4;&#xB978; &#xAC12;&#xC744; &#xC918;&#xC57C;&#xD560; &#xACBD;&#xC6B0;&#xC5D0;&#xB294; &#xC0AC;&#xC6A9;&#xD558;&#xBA74; &#xC548;&#xB41C;&#xB2E4;. headers&#xC5D0; &#xB2E4;&#xB978; &#xC815;&#xBCF4;&#xB97C; &#xC804;&#xB2EC;&#xD558;&#xB354;&#xB77C;&#xB3C4; &#xCFFC;&#xB9AC;&#xC2A4;&#xD2B8;&#xB9C1;&#xC774; &#xB3D9;&#xC77C;&#xD55C; &#xACBD;&#xC6B0; &#xCE90;&#xC2DC;&#xC5D0;&#xC11C; &#xAC19;&#xC740; &#xAC12;&#xC73C;&#xB85C; &#xC751;&#xB2F5;&#xD55C;&#xB2E4;.</p>
<p>CloudFront&#xC5D0;&#xC11C; API Gateway&#xB85C; headers&#xC758; &#xC815;&#xBCF4; &#xC911; &#xD3EC;&#xC6CC;&#xB4DC; &#xD560;&#xAC8C; &#xC788;&#xB294; &#xACBD;&#xC6B0; host &#xC815;&#xBCF4;&#xB97C; &#xB118;&#xACA8;&#xC8FC;&#xBA74; CloudFront &#xC624;&#xB958;&#xAC00; &#xBC1C;&#xC0DD;&#xD55C;&#xB2E4;.</p>
<h3 id="lambda">2. Lambda</h3>
<p>Lambda &#xC791;&#xC5C5;&#xC2DC; <code>console.log</code> &#xAC19;&#xC774; &#xCD9C;&#xB825;&#xBB38;&#xC744; &#xB123;&#xC5B4;&#xC8FC;&#xBA74; &#xD574;&#xB2F9; Lambda&#xC758; CloudWatch&#xC5D0;&#xC11C; &#xCD9C;&#xB825;&#xBB38;&#xC744; &#xBCFC; &#xC218; &#xC788;&#xB2E4;. &#xC774;&#xAC78; &#xC774;&#xC6A9;&#xD574;&#xC11C; &#xCD08;&#xBC18;&#xC5D0; &#xD14C;&#xC2A4;&#xD2B8; &#xD560; &#xB54C;&#xB294; &#xD544;&#xC694;&#xD55C; &#xBAA8;&#xB4E0; &#xACF3;&#xC5D0; <code>console.log, console.info, console.dir</code> &#xB4F1;&#xC744; &#xC774;&#xC6A9;&#xD574;&#xC11C; &#xD655;&#xC778;&#xC774; &#xAC00;&#xB2A5;&#xD558;&#xBA70;, &#xC11C;&#xBE44;&#xC2A4;&#xC6A9;&#xC73C;&#xB85C; &#xC62C;&#xB9B4;&#xB54C;&#xB3C4; <code>event</code> &#xC815;&#xBCF4;&#xB294; <code>console.info</code>&#xB85C; &#xCD9C;&#xB825;&#xC744; &#xD574; &#xB193;&#xC73C;&#xBA74; &#xC624;&#xB958; &#xBC1C;&#xC0DD;&#xC2DC; &#xBB50; &#xB54C;&#xBB38;&#xC774;&#xC9C0; &#xD655;&#xC778;&#xD560;&#xB54C; &#xD3B8;&#xB9AC;&#xD558;&#xB2E4;. API Gateway&#xC758; &#xB85C;&#xADF8;&#xB97C; &#xBCF4;&#xBA74; event&#xC815;&#xBCF4;&#xAC00; &#xC9E4;&#xB824;&#xC11C; &#xCD9C;&#xB825;&#xB418;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC804;&#xCCB4; &#xB2E4;&#xB97C; &#xBCFC;&#xB824;&#xBA74; Lambda&#xCABD;&#xC5D0;&#xC11C; &#xCD9C;&#xB825;&#xD574;&#xC918;&#xC57C; &#xD55C;&#xB2E4;. &#xB2F9;&#xC5F0;&#xD788; &#xC774;&#xB807;&#xAC8C; &#xD558;&#xBA74; &#xC131;&#xB2A5;&#xC5D0; &#xC601;&#xD5A5;&#xC744; &#xBBF8;&#xCE58;&#xBBC0;&#xB85C; &#xADF8;&#xAC8C; &#xAC71;&#xC815;&#xC2A4;&#xB7FD;&#xB2E4;&#xBA74; &#xCD5C;&#xC18C;&#xD55C; <code>try-catch</code>&#xB97C; &#xC774;&#xC6A9;&#xD574;&#xC11C; &#xC624;&#xB958; &#xC0C1;&#xD669;&#xC5D0;&#xC11C;&#xB9CC;&#xC774;&#xB77C;&#xB3C4; &#xCD9C;&#xB825;&#xD574; &#xB193;&#xC73C;&#xBA74; &#xB098;&#xC911;&#xC5D0; &#xB514;&#xBC84;&#xAE45; &#xD560; &#xB54C; &#xC88B;&#xB2E4;.</p>
<p>TypeScript&#xB85C; &#xC791;&#xC5C5;&#xD560; &#xACBD;&#xC6B0; Node 4.3&#xC5D0;&#xC11C; &#xC815;&#xC0C1;&#xC801;&#xC73C;&#xB85C; &#xB3D9;&#xC791;&#xD558;&#xB294; &#xCF54;&#xB4DC;&#xB77C;&#xB3C4; Lambda&#xC5D0; &#xC62C;&#xB838;&#xC744; &#xACBD;&#xC6B0; &#xB3D9;&#xC791;&#xD558;&#xC9C0; &#xC54A;&#xC744; &#xC218;&#xB3C4; &#xC788;&#xC73C;&#xB2C8; &#xAF2D; &#xD14C;&#xC2A4;&#xD2B8;&#xB97C; &#xBA3C;&#xC800; &#xD574;&#xBCF4;&#xACE0; &#xC791;&#xC5C5;&#xC744; &#xD558;&#xB294;&#xAC8C; &#xC88B;&#xB2E4;. class, async/await &#xB4F1;&#xC740; &#xC81C;&#xB300;&#xB85C; &#xB418;&#xC9C0;&#xB9CC; static, default parameter &#xB4F1;&#xC5D0; &#xB300;&#xD574;&#xC11C;&#xB294; &#xC81C;&#xB300;&#xB85C; &#xB3D9;&#xC791;&#xD558;&#xC9C0; &#xC54A;&#xB294;&#xB2E4;.</p>
<h3 id="api-gateway">3. API Gateway</h3>
<p>API Gateway&#xB294; Lambda &#xD638;&#xCD9C;&#xD6C4; 30&#xCD08; &#xB3D9;&#xC548;&#xB9CC; &#xAE30;&#xB2E4;&#xB9B0;&#xB2E4;. &#xADF8;&#xB7EC;&#xB2C8; &#xD574;&#xB2F9; Lambda &#xC2E4;&#xD589;&#xC2DC;&#xAC04;&#xC744; 30&#xCD08; &#xC774;&#xC0C1;&#xC73C;&#xB85C; &#xC124;&#xC815;&#xD560; &#xD544;&#xC694;&#xAC00; &#xC5C6;&#xB2E4;.</p>
<p>API Gateway&#xB97C; {proxy+} &#xC124;&#xC815;&#xC73C;&#xB85C; &#xC0AC;&#xC6A9;&#xD558;&#xACE0;, 1&#xAC1C;&#xC758; Lambda&#xC5D0;&#xC11C; 2&#xAC00;&#xC9C0; &#xC774;&#xC0C1;&#xC758; API &#xCF54;&#xB4DC;&#xAC00; &#xB4E4;&#xC5B4;&#xC788;&#xB354;&#xB77C;&#xB3C4;, Lambda&#xB97C; &#xB2E4;&#xB978; &#xC774;&#xB984;&#xC73C;&#xB85C; &#xBC30;&#xD3EC;&#xD558;&#xC5EC; &#xAC01; API&#xBCC4;&#xB85C; &#xD560;&#xB2F9;&#xD558;&#xB294;&#xAC8C; &#xC88B;&#xB2E4;. &#xB9CC;&#xC57D; 1&#xAC1C;&#xC758; Lambda&#xC5D0; 2&#xAC1C; &#xC774;&#xC0C1;&#xC758; API&#xAC00; &#xAC19;&#xC774; &#xCC98;&#xB9AC; &#xB420; &#xACBD;&#xC6B0; &#xC624;&#xB958; &#xBC1C;&#xC0DD; &#xC0C1;&#xD669;&#xC5D0;&#xC11C; &#xB85C;&#xADF8;&#xB85C; &#xD655;&#xC778;&#xD558;&#xB294;&#xAC8C; &#xD798;&#xB4E4;&#xB2E4;. &#xC774;&#xAC8C; &#xB9D8;&#xC5D0; &#xC548;&#xB4E0;&#xB2E4;&#xBA74; &#xB354; &#xC774;&#xC0C1; &#xC624;&#xB958;&#xAC00; &#xBC1C;&#xC0DD;&#xD558;&#xC9C0; &#xC54A;&#xACE0; &#xC548;&#xC815;&#xC801;&#xC73C;&#xB85C; &#xC11C;&#xBE44;&#xC2A4;&#xB418;&#xACE0; &#xC788;&#xB294; &#xC0C1;&#xD669;&#xC5D0;&#xC11C; Lambda &#xBC0F; API Gateway&#xC758; {proxy+} &#xC124;&#xC815;&#xC744; &#xD569;&#xCE58;&#xBA74; &#xB41C;&#xB2E4;.</p>
<p>API Gateway&#xC5D0;&#xB294; &#xCFFC;&#xB9AC;&#xC2A4;&#xD2B8;&#xB9C1;&#xC744; &#xD30C;&#xC2F1;&#xD558;&#xC5EC; JSON &#xD615;&#xD0DC;&#xB85C; Lambda&#xC5D0; &#xC804;&#xB2EC;&#xB41C;&#xB2E4;. &#xADF8;&#xB7F0;&#xB370; &#xADF8; &#xACFC;&#xC815;&#xC5D0;&#xC11C; &#xAE30;&#xC874;&#xC758; &#xB2E4;&#xB978; &#xC6F9; &#xD504;&#xB808;&#xC784;&#xC6CC;&#xD06C;&#xB791; &#xB2E4;&#xB974;&#xAC8C; &#xB3D9;&#xC791;&#xD55C;&#xB2E4;. &#xB300;&#xD45C;&#xC801;&#xC778; &#xC608;&#xAC00; &#xCFFC;&#xB9AC;&#xC2A4;&#xD2B8;&#xB9C1;&#xC758; &#xACBD;&#xC6B0; &#xAD6C;&#xBD84;&#xC790;&#xB85C; <code>&amp;</code>&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xB294;&#xB370; API Gateway&#xC5D0;&#xC11C;&#xB294; <code>;</code>&#xB3C4; &#xAD6C;&#xBD84;&#xC790;&#xB85C; &#xC778;&#xC2DD;&#xC740; &#xD55C;&#xB2E4;. &#xADF8;&#xB807;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; <code>?idList=1;2;3&amp;filter=name;phone&amp;flag=1;2</code>&#xB85C; &#xC804;&#xB2EC;&#xD560; &#xB54C; API Gateway&#xB294; <code>{IdList: 1, 2: , 3: , filter:name, phone: , flag: 1}</code> &#xC2DD;&#xC73C;&#xB85C; &#xD574;&#xC11D;&#xC744; &#xD574;&#xBC84;&#xB9B0;&#xB2E4;. &#xC800;&#xB7F0; &#xBAA8;&#xC591;&#xC774;&#xB77C;&#xB3C4; &#xC5B5;&#xC9C0;&#xB85C; &#xD574;&#xC11D;&#xD574;&#xC11C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xBC29;&#xBC95;&#xB3C4; &#xC788;&#xC9C0;&#xB9CC; &#xADF8; &#xACFC;&#xC815;&#xC5D0;&#xC11C; idList&#xC758; 2&#xC640; flag&#xC758; 2&#xAC1C; &#xAC19;&#xC740; key&#xB85C; &#xC778;&#xC2DD;&#xC774; &#xB418;&#xC5B4;&#xC11C; &#xD574;&#xC11D;&#xC774; &#xC560;&#xB9E4;&#xBAA8;&#xD638;&#xD574;&#xC9C4;&#xB2E4;. &#xBC30;&#xC5F4;&#xAC12;&#xC744; <code>?id=1&amp;id=2&amp;id=3</code>&#xC758; &#xBAA8;&#xC591;&#xC73C;&#xB85C; &#xC804;&#xB2EC;&#xD560; &#xACBD;&#xC6B0;&#xC5D0;&#xB3C4; <code>{id:3}</code>&#xC73C;&#xB85C; &#xB9C8;&#xC9C0;&#xB9C9;&#xAC12; &#xD558;&#xB098;&#xB9CC; &#xB0A8;&#xACA8;&#xB450;&#xACE0; &#xB2E4; &#xC0AC;&#xB77C;&#xC9C4;&#xB2E4;. &#xD604;&#xC7AC;&#xB85C;&#xC11C;&#xB294; &#xC81C;&#xB300;&#xB85C; &#xCC98;&#xB9AC;&#xB418;&#xB3C4;&#xB85D; &#xD558;&#xB294; &#xBC29;&#xBC95;&#xC744; &#xCC3E;&#xC9C0; &#xBABB;&#xD588;&#xB2E4;. CloudFront&#xC0C1;&#xC758; &#xB9AC;&#xD018;&#xC2A4;&#xD2B8; &#xB85C;&#xADF8;&#xB97C; &#xC0B4;&#xD3B4;&#xBCF4;&#xBA74; &#xCFFC;&#xB9AC;&#xC2A4;&#xD2B8;&#xB9C1;&#xC758; &#xBAA8;&#xC591;&#xC774; &#xADF8;&#xB300;&#xB85C; &#xB0A8;&#xC544;&#xC788;&#xB294; &#xAC83;&#xC73C;&#xB85C; &#xBD10;&#xC11C;&#xB294; LambdaEdge&#xB97C; &#xC0AC;&#xC6A9;&#xD574;&#xC11C; &#xCFFC;&#xB9AC;&#xC2A4;&#xD2B8;&#xB9C1;&#xC744; &#xC218;&#xC815;&#xD55C; &#xB4A4; API Gateway&#xB85C; &#xC804;&#xB2EC;&#xD558;&#xC5EC; &#xCC98;&#xB9AC;&#xD558;&#xB294; &#xBC29;&#xBC95;&#xB3C4; &#xC788;&#xACA0;&#xC9C0;&#xB9CC;, &#xD604;&#xC2DC;&#xC810;(2017&#xB144; 2&#xC6D4;) LambdaEdge&#xB294; &#xD504;&#xB9AC;&#xBDF0;&#xC778;&#xB370;&#xB2E4;&#xAC00; &#xB9AC;&#xC83C;&#xB2F9; 100&#xAC1C;&#xC758; &#xB9AC;&#xBBF8;&#xD2B8; &#xBC16;&#xC5D0; &#xD5C8;&#xC6A9;&#xD558;&#xC9C0; &#xC54A;&#xC544;&#xC11C; &#xC2E4;&#xC81C; &#xC11C;&#xBE44;&#xC2A4;&#xC5D0; &#xC0AC;&#xC6A9;&#xD558;&#xAE30;&#xC5D0;&#xB294; &#xB9DD;&#xC124;&#xC5EC;&#xC9C4;&#xB2E4;. &#xB2F9;&#xC5F0;&#xD55C; &#xC774;&#xC57C;&#xAE30;&#xC9C0;&#xB9CC; &#xC694;&#xCCAD;&#xD558;&#xB294; &#xCABD;&#xC5D0;&#xC11C; <code>;</code>&#xB97C; &#xC778;&#xCF54;&#xB529;&#xD558;&#xC5EC; <code>%3B</code>&#xB85C; &#xC804;&#xB2EC;&#xD558;&#xBA74; &#xC815;&#xC0C1;&#xC801;&#xC73C;&#xB85C; &#xCC98;&#xB9AC;&#xAC00; &#xAC00;&#xB2A5;&#xD558;&#xB2E4;.</p>
<h2 id="lambda&#xC640;-api-gateway&#xB97C;-&#xC774;&#xC6A9;&#xD574;&#xC11C;-serverless-web-api-&#xB9CC;&#xB4E4;&#xAE30;">Lambda&#xC640; API Gateway&#xB97C; &#xC774;&#xC6A9;&#xD574;&#xC11C; Serverless Web API &#xB9CC;&#xB4E4;&#xAE30;</h2>
<ul>
<li><a href="https://github.com/DevStarSJ/Study/blob/master/Blog/Cloud/AWS/Lambda%2BAPIGateWay.01.md" target="_blank" rel="external">Lambda &#xC640; API Gateway &#xC5F0;&#xB3D9; #1 (GET, POST)</a></li>
<li><a href="https://github.com/DevStarSJ/Study/blob/master/Blog/Cloud/AWS/Lambda%2BAPIGateway.02.Route.md" target="_blank" rel="external">Lambda &#xC640; API Gateway &#xC5F0;&#xB3D9; #2 (ANY, Deploy Staging, Node.JS Route)</a></li>
<li><a href="https://github.com/DevStarSJ/Study/blob/master/Blog/Cloud/AWS/Lambda%2BAPIGateway.03.Proxy.md" target="_blank" rel="external">Lambda &#xC640; API Gateway &#xC5F0;&#xB3D9; #3 (Proxy Resource)</a></li>
<li><a href="https://github.com/DevStarSJ/Study/blob/master/Blog/Cloud/AWS/Lambda.Packaging.Node.md" target="_blank" rel="external">Lambda Node.JS Packaging</a></li>
<li><a href="https://github.com/DevStarSJ/Study/blob/master/Blog/Cloud/AWS/Lambda.Python.md" target="_blank" rel="external">AWS Lambda&#xC5D0; Python Handler &#xB9CC;&#xB4E4;&#xAE30;</a></li>
<li><a href="https://github.com/DevStarSJ/Study/blob/master/Blog/Cloud/AWS/Lambda.Packaging.Python.md" target="_blank" rel="external">Lambda Python Packaging</a></li>
<li><a href="https://github.com/DevStarSJ/Study/blob/master/Blog/Cloud/AWS/Lambda.CSharp.md" target="_blank" rel="external">Lambda C# Handler &#xB9CC;&#xB4E4;&#xAE30;</a></li>
</ul>

        </div>
        <footer class="article-footer">
            



    <a data-url="http://DevStarSJ.github.io/2017/02/26/MonolithToServerless.03/" data-id="cj2430324005bkc7bt369vk44" class="article-share-link"><i class="fa fa-share"></i>Share</a>
<script>
    (function ($) {
        $('body').on('click', function() {
            $('.article-share-box.on').removeClass('on');
        }).on('click', '.article-share-link', function(e) {
            e.stopPropagation();

            var $this = $(this),
                url = $this.attr('data-url'),
                encodedUrl = encodeURIComponent(url),
                id = 'article-share-box-' + $this.attr('data-id'),
                offset = $this.offset(),
                box;

            if ($('#' + id).length) {
                box = $('#' + id);

                if (box.hasClass('on')){
                    box.removeClass('on');
                    return;
                }
            } else {
                var html = [
                    '<div id="' + id + '" class="article-share-box">',
                        '<input class="article-share-input" value="' + url + '">',
                        '<div class="article-share-links">',
                            '<a href="https://twitter.com/intent/tweet?url=' + encodedUrl + '" class="article-share-twitter" target="_blank" title="Twitter"></a>',
                            '<a href="https://www.facebook.com/sharer.php?u=' + encodedUrl + '" class="article-share-facebook" target="_blank" title="Facebook"></a>',
                            '<a href="http://pinterest.com/pin/create/button/?url=' + encodedUrl + '" class="article-share-pinterest" target="_blank" title="Pinterest"></a>',
                            '<a href="https://plus.google.com/share?url=' + encodedUrl + '" class="article-share-google" target="_blank" title="Google+"></a>',
                        '</div>',
                    '</div>'
                ].join('');

              box = $(html);

              $('body').append(box);
            }

            $('.article-share-box.on').hide();

            box.css({
                top: offset.top + 25,
                left: offset.left
            }).addClass('on');

        }).on('click', '.article-share-box', function (e) {
            e.stopPropagation();
        }).on('click', '.article-share-box-input', function () {
            $(this).select();
        }).on('click', '.article-share-box-link', function (e) {
            e.preventDefault();
            e.stopPropagation();

            window.open(this.href, 'article-share-box-window-' + Date.now(), 'width=500,height=450');
        });
    })(jQuery);
</script>

        </footer>
    </div>
</article>

    <section id="comments">
    
        
    <div id="disqus_thread">
        <noscript>Please enable JavaScript to view the <a href="//disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
    </div>

    
    </section>


                        </div>
                    </section>
                    <aside id="sidebar">
    <a class="sidebar-toggle" title="Expand Sidebar"><i class="toggle icon"></i></a>
    <div class="sidebar-top">
        <p>follow:</p>
        <ul class="social-links">
            
                
                <li>
                    <a class="social-tooltip" title="facebook-square" href="https://www.facebook.com/seokjoon.yun.9" target="_blank">
                        <i class="icon fa fa-facebook-square"></i>
                    </a>
                </li>
                
            
                
                <li>
                    <a class="social-tooltip" title="github" href="https://github.com/DevStarSJ" target="_blank">
                        <i class="icon fa fa-github"></i>
                    </a>
                </li>
                
            
                
                <li>
                    <a class="social-tooltip" title="slideshare" href="https://www.slideshare.net/seokjoonyun9" target="_blank">
                        <i class="icon fa fa-slideshare"></i>
                    </a>
                </li>
                
            
                
                <li>
                    <a class="social-tooltip" title="linkedin-square" href="https://www.linkedin.com/in/sjyun" target="_blank">
                        <i class="icon fa fa-linkedin-square"></i>
                    </a>
                </li>
                
            
                
                <li>
                    <a class="social-tooltip" title="google-plus" href="https://plus.google.com/u/1/108379332089647292574" target="_blank">
                        <i class="icon fa fa-google-plus"></i>
                    </a>
                </li>
                
            
        </ul>
    </div>
    
        
<nav id="article-nav">
    
        <a href="/2017/03/11/Lambda.Tips.01/" id="article-nav-newer" class="article-nav-link-wrap">
        <strong class="article-nav-caption">newer</strong>
        <p class="article-nav-title">
        
            AWS Lambda 사용에 관련된 Tip
        
        </p>
        <i class="icon fa fa-chevron-right" id="icon-chevron-right"></i>
    </a>
    
    
        <a href="/2017/02/25/MonolithToServerless.02/" id="article-nav-older" class="article-nav-link-wrap">
        <strong class="article-nav-caption">older</strong>
        <p class="article-nav-title">Monolith to Serverless using AWS Lambda (2)</p>
        <i class="icon fa fa-chevron-left" id="icon-chevron-left"></i>
        </a>
    
</nav>

    
    <div class="widgets-container">
        
            
                
    <div class="widget-wrap widget-list">
        <h3 class="widget-title">categories</h3>
        <div class="widget">
            <ul class="category-list"><li class="category-list-item"><a class="category-list-link" href="/categories/AWS/">AWS</a><span class="category-list-count">14</span><ul class="category-list-child"><li class="category-list-item"><a class="category-list-link" href="/categories/AWS/Lambda/">Lambda</a><span class="category-list-count">14</span></li></ul></li><li class="category-list-item"><a class="category-list-link" href="/categories/C/">C#</a><span class="category-list-count">15</span><ul class="category-list-child"><li class="category-list-item"><a class="category-list-link" href="/categories/C/ASP-NET/">ASP.NET</a><span class="category-list-count">6</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/C/ASP-NET-Core/">ASP.NET Core</a><span class="category-list-count">4</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/C/C/">C#</a><span class="category-list-count">5</span></li></ul></li><li class="category-list-item"><a class="category-list-link" href="/categories/Database/">Database</a><span class="category-list-count">23</span><ul class="category-list-child"><li class="category-list-item"><a class="category-list-link" href="/categories/Database/Oracle/">Oracle</a><span class="category-list-count">2</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/Database/SQLP/">SQLP</a><span class="category-list-count">21</span></li></ul></li><li class="category-list-item"><a class="category-list-link" href="/categories/DevOps/">DevOps</a><span class="category-list-count">2</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/JavaScript/">JavaScript</a><span class="category-list-count">3</span><ul class="category-list-child"><li class="category-list-item"><a class="category-list-link" href="/categories/JavaScript/Node-JS/">Node.JS</a><span class="category-list-count">1</span></li><li class="category-list-item"><a class="category-list-link" href="/categories/JavaScript/TypeScript/">TypeScript</a><span class="category-list-count">2</span></li></ul></li><li class="category-list-item"><a class="category-list-link" href="/categories/Python/">Python</a><span class="category-list-count">1</span><ul class="category-list-child"><li class="category-list-item"><a class="category-list-link" href="/categories/Python/DoingMathWithPython/">DoingMathWithPython</a><span class="category-list-count">1</span></li></ul></li><li class="category-list-item"><a class="category-list-link" href="/categories/Tips/">Tips</a><span class="category-list-count">1</span><ul class="category-list-child"><li class="category-list-item"><a class="category-list-link" href="/categories/Tips/macOS/">macOS</a><span class="category-list-count">1</span></li></ul></li></ul>
        </div>
    </div>


            
                
    <div class="widget-wrap widget-float">
        <h3 class="widget-title">tag cloud</h3>
        <div class="widget tagcloud">
            <a href="/tags/APIGateway/" style="font-size: 16.67px;">APIGateway</a> <a href="/tags/ASP-NET/" style="font-size: 15.56px;">ASP.NET</a> <a href="/tags/ASP-NET-Core/" style="font-size: 13.33px;">ASP.NET Core</a> <a href="/tags/AWS/" style="font-size: 17.78px;">AWS</a> <a href="/tags/C/" style="font-size: 18.89px;">C#</a> <a href="/tags/CI-CD/" style="font-size: 11.11px;">CI/CD</a> <a href="/tags/Database/" style="font-size: 20px;">Database</a> <a href="/tags/DevOps/" style="font-size: 11.11px;">DevOps</a> <a href="/tags/JavaScript/" style="font-size: 12.22px;">JavaScript</a> <a href="/tags/Lambda/" style="font-size: 17.78px;">Lambda</a> <a href="/tags/Math/" style="font-size: 10px;">Math</a> <a href="/tags/Node-JS/" style="font-size: 14.44px;">Node.JS</a> <a href="/tags/Oracle/" style="font-size: 20px;">Oracle</a> <a href="/tags/Python/" style="font-size: 13.33px;">Python</a> <a href="/tags/SQLP/" style="font-size: 20px;">SQLP</a> <a href="/tags/Serverless/" style="font-size: 12.22px;">Serverless</a> <a href="/tags/TypeScript/" style="font-size: 11.11px;">TypeScript</a> <a href="/tags/macOS/" style="font-size: 10px;">macOS</a>
        </div>
    </div>


            
                
    <div class="widget-wrap widget-list">
        <h3 class="widget-title">links</h3>
        <div class="widget">
            <ul>
                
                    <li>
                        <a href="http://hexo.io">Hexo</a>
                    </li>
                
            </ul>
        </div>
    </div>


            
        
    </div>
</aside>
                </div>
            </div>
        </div>
        <footer id="footer">
    <div class="container">
        <div class="container-inner">
            <a id="back-to-top" href="javascript:;"><i class="icon fa fa-angle-up"></i></a>
            <div class="credit">
                <h1 class="logo-wrap">
                    <a href="/" class="logo"></a>
                </h1>
                <p>&copy; 2017 Yun Seok-joon</p>
                <p>Powered by <a href="//hexo.io/" target="_blank">Hexo</a>. Theme by <a href="//github.com/ppoffice" target="_blank">PPOffice</a></p>
            </div>
        </div>
    </div>
</footer>
        
    
    <script>
    var disqus_shortname = 'hexo-theme-hueman';
    
    
    var disqus_url = 'http://DevStarSJ.github.io/2017/02/26/MonolithToServerless.03/';
    
    (function() {
    var dsq = document.createElement('script');
    dsq.type = 'text/javascript';
    dsq.async = true;
    dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
    (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
    })();
    </script>




    
        <script src="/libs/lightgallery/js/lightgallery.min.js"></script>
        <script src="/libs/lightgallery/js/lg-thumbnail.min.js"></script>
        <script src="/libs/lightgallery/js/lg-pager.min.js"></script>
        <script src="/libs/lightgallery/js/lg-autoplay.min.js"></script>
        <script src="/libs/lightgallery/js/lg-fullscreen.min.js"></script>
        <script src="/libs/lightgallery/js/lg-zoom.min.js"></script>
        <script src="/libs/lightgallery/js/lg-hash.min.js"></script>
        <script src="/libs/lightgallery/js/lg-share.min.js"></script>
        <script src="/libs/lightgallery/js/lg-video.min.js"></script>
    
    
        <script src="/libs/justified-gallery/jquery.justifiedGallery.min.js"></script>
    
    


<!-- Custom Scripts -->
<script src="/js/main.js"></script>

    </div><!-- hexo-inject:begin --><!-- hexo-inject:end -->
</body>
</html>
